{
  "itineraries": [
    {
      "id": 1,
      "name": "Beach Vacation",
      "description": "A relaxing vacation at the beach",
      "location": "worldwide",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 1,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": ""
    },
    {
      "id": 2,
      "name": "Beach Vacation",
      "description": "A relaxing vacation at the beach",
      "location": "Hawaii",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 1,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "## Sustainable Travel Itinerary: Greenbuild & Farm Stay Adventure\n\n**Destination:**  **[Choose your preferred location]** - This itinerary can be customized for any location hosting the Greenbuild International Conference & Expo. \n\n**Package:** **Eco-Friendly Adventure**\n\n**Accommodation:** **[Choose your preferred Farm Hotel]** - Look for hotels certified by organizations like Green Key or LEED, offering sustainable practices like organic farming, renewable energy, and waste reduction.\n\n**Transportation:** **Bike** (for local travel) & **[transport.name]** (for long-distance travel) - Ensure your chosen transportation aligns with your sustainability goals. Consider eco-friendly options like electric vehicles, trains, or carpooling.\n\n**Guide:** **Paulo**\n\n**Meals:** **Vegetarian**\n\n**Itinerary:**\n\n**Day 1:**\n\n* **Morning:** Arrive at [Airport/Train Station] and transfer to your chosen Farm Hotel using [transport.name].\n* **Afternoon:** Settle into your single room and enjoy a welcome vegetarian lunch at the hotel restaurant featuring locally sourced ingredients.\n* **Evening:** Attend a welcome dinner at the hotel with other guests. Enjoy the local atmosphere and learn about the farm's sustainable practices.\n\n**Day 2:**\n\n* **Morning:** Start your day with a guided bike tour with Paulo through the local area, exploring farms, markets, and scenic landscapes.\n* **Lunch:** Enjoy a delicious vegetarian lunch at a local farm-to-table restaurant.\n* **Afternoon:** Participate in a hands-on workshop at the farm, learning about sustainable farming techniques like composting, seed saving, or permaculture.\n* **Evening:** Relax and enjoy a vegetarian dinner at the hotel, accompanied by live music or a bonfire.\n\n**Day 3:**\n\n* **Morning:** Head to the Greenbuild International Conference & Expo. Take a [transport.name] to the venue.\n* **Day:** Immerse yourself in the conference, exploring the latest innovations in green building, sustainable design, and environmental technologies.\n* **Evening:** Return to the hotel and enjoy a relaxing evening with a vegetarian dinner at the hotel restaurant.\n\n**Day 4:**\n\n* **Morning:** Participate in a guided bike tour with Paulo, exploring local green initiatives and community gardens. \n* **Lunch:** Have a vegetarian picnic lunch at a scenic spot along the route.\n* **Afternoon:** Return to the hotel and engage in optional activities like yoga, meditation, or a spa treatment. \n* **Evening:** Enjoy a farewell dinner at the hotel, savoring a delicious vegetarian meal and reflecting on your experiences.\n\n**Day 5:**\n\n* **Morning:** Depart from the hotel and head to the airport/train station using [transport.name].\n\n**Throughout your trip:**\n\n* Embrace local customs and traditions. \n* Support local businesses and artisans.\n* Minimize waste by using reusable water bottles, bags, and utensils.\n* Practice responsible tourism by respecting local wildlife and ecosystems.\n\n**This itinerary is customizable:**\n\n* Choose a location that best suits your interests and budget.\n* Adjust the activities to fit your personal preferences.\n* Add more days to explore other nearby attractions.\n* Enhance your experience with additional activities like hiking, kayaking, or birdwatching.\n\n**By choosing this sustainable travel itinerary, you contribute to responsible tourism while enjoying a meaningful and enriching experience.**"
    },
    {
      "id": 3,
      "name": "Beach Vacation",
      "description": "A relaxing vacation at the beach",
      "location": "Hawaii",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 1,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Adventure Itinerary: Greenbuild International Conference and Expo with Paulo\n\n**This itinerary combines the Greenbuild International Conference and Expo with a sustainable farm stay experience, focusing on vegetarian meals, eco-friendly accommodation, and biking exploration.**\n\n**Destination:**  **[Choose a location hosting Greenbuild Conference] ** (e.g., Toronto, Canada)\n\n**Duration:** 7 Days (flexible)\n\n**Accommodation:**\n\n* **Farm Hotel:**  [Choose a Farm Hotel near the conference location, focusing on sustainable practices like organic farming and renewable energy. Example: **The Farm at Tintern, Wales** or **The Farmhouse at Red Roofs, India**] \n* **Room:** Single\n\n**Transportation:**\n\n* **To/from the Conference:**  $(transport.name) \n* **Within the Destination:**  **Bike**\n\n**Guide:**\n\n* **Paulo:** [If Paulo is a local guide with knowledge of sustainable tourism, include his contact info. Otherwise, find a local guide specializing in eco-tours and biking.]\n\n**Meals:**\n\n* All meals will be vegetarian and sourced locally from the farm whenever possible. \n\n**Day 1:**\n\n* Arrive at the Farm Hotel and settle in.\n* Enjoy a welcome vegetarian dinner at the farm restaurant, featuring fresh, locally sourced ingredients.\n* Discuss your itinerary and explore sustainable activities with Paulo.\n\n**Day 2:**\n\n* **Greenbuild International Conference and Expo:** Attend the conference and network with fellow sustainability professionals.\n* Enjoy a vegetarian lunch at the conference venue.\n* After the conference, bike through the city, exploring its green spaces and sustainable initiatives.\n* Return to the farm for a relaxing evening and a delicious vegetarian dinner.\n\n**Day 3:**\n\n* **Farm Experience:** Participate in farm activities like gardening, harvesting, or animal care.\n* Enjoy a vegetarian lunch made with farm-fresh produce.\n* Explore the surrounding area on your bike, taking in the local scenery.\n* Return to the farm for a relaxing evening with a delicious vegetarian dinner.\n\n**Day 4:**\n\n* **Sustainable Tourism:**  Paulo will guide you on a scenic bike ride to explore local sustainable projects like community gardens, eco-friendly businesses, or nature reserves.\n* Enjoy a packed vegetarian lunch while on your bike tour.\n* Relax at the farm and enjoy a vegetarian dinner with freshly picked ingredients.\n\n**Day 5:**\n\n* **Free Time:** Choose your own adventure! Explore local markets, visit art galleries, or simply relax and enjoy the farm atmosphere.\n* Enjoy a vegetarian lunch at the farm.\n* Enjoy a peaceful evening on the farm, taking in the scenic surroundings.\n\n**Day 6:**\n\n* **Local Market Tour:**  Paulo will lead you on a bike tour to local farmers' markets, where you can sample local products and learn about sustainable agriculture.\n* Enjoy a vegetarian lunch at the farm.\n* Attend a farm-to-table cooking demonstration, learning how to prepare delicious vegetarian dishes using fresh, local ingredients.\n\n**Day 7:**\n\n* Depart from the Farm Hotel.\n\n**Additional Information:**\n\n* **Eco-Friendly Adventure Package:** Include sustainable practices like:\n    * Using local and organic produce for meals.\n    * Minimizing waste through composting and recycling.\n    * Promoting energy efficiency and using renewable energy sources.\n    * Using biodegradable cleaning products and toiletries.\n* **Bike Rental:** Ensure that bikes are provided by the farm or are available for rent locally.\n\n**Optional Activities:**\n\n* **Volunteer at a local environmental organization.**\n* **Take a workshop on sustainable living.**\n* **Attend a local cultural event or festival.**\n\n**This itinerary is a starting point and can be customized to fit your interests and preferences.  You can add or remove days, activities, and destinations based on your needs.** \n"
    },
    {
      "id": 4,
      "name": "Beach Vacation",
      "description": "A relaxing vacation at the beach",
      "location": "Hawaii",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 1,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Adventure at Greenbuild: A Personalized Itinerary\n\n**Destination:**  **Greenbuild International Conference and Expo, Las Vegas, USA** \n\n**Accommodation:** **The Farm at Tule Springs, Nevada** (eco-friendly farm hotel with single occupancy rooms)\n\n**Transportation:** **Bike (personal) for local exploration + $(transport.name) for travel to/from Las Vegas**\n\n**Guide:** **Paulo**\n\n**Package:** **Eco-Friendly Adventure**\n\n**Dietary:** **Vegetarian**\n\n**Itinerary:**\n\n**Day 1:**\n\n* Arrive at Las Vegas McCarran International Airport (LAS) and take $(transport.name) to The Farm at Tule Springs. \n* Settle in and enjoy a welcome vegetarian dinner at the farm's restaurant.\n* Enjoy a guided bike tour with Paulo around the farm, learning about their sustainable practices and local agriculture.\n\n**Day 2:**\n\n* Start your day with a healthy vegetarian breakfast at the farm.\n* Cycle to Greenbuild International Conference and Expo, immersing yourself in the world of sustainable building and design. \n* Attend workshops, presentations, and networking events related to your interests.\n* Enjoy a vegetarian lunch at the Greenbuild Expo.\n* Return to The Farm for a relaxing evening.\n\n**Day 3:**\n\n* Breakfast at the farm followed by a leisurely morning exploring the nearby Red Rock Canyon National Conservation Area on your bike.\n* Enjoy a picnic lunch with vegetarian snacks while taking in the breathtaking desert landscapes.\n* Return to the farm for a late afternoon of relaxation and a delicious vegetarian dinner.\n\n**Day 4:**\n\n* Start the day with a morning yoga session on the farm, surrounded by nature. \n* After breakfast, enjoy a guided farm tour with Paulo, learning about their regenerative farming techniques and sustainable practices.\n* Participate in a hands-on workshop, such as composting or seed starting.\n* Enjoy a delicious vegetarian lunch prepared with fresh farm produce.\n* Relax and enjoy the afternoon at the farm, perhaps reading a book or exploring the grounds.\n\n**Day 5:**\n\n* Enjoy a final vegetarian breakfast at the farm.\n* Pack your belongings and check out of the farm.\n* Take $(transport.name) to McCarran International Airport (LAS) for your departure.\n\n**This itinerary can be customized to your specific interests and needs, including:**\n\n* Adding additional days for further exploration of the Las Vegas area.\n* Visiting other sustainable attractions like the Springs Preserve or the Ethel M Chocolate Factory & Botanical Cactus Garden.\n* Incorporating additional activities like hiking, rock climbing, or birdwatching.\n* Adjusting the transportation based on your preferences and accessibility needs.\n\n**This eco-friendly adventure package will provide you with an enriching experience while supporting sustainable practices. You'll enjoy the comforts of the farm hotel, the freedom of exploring on your bike, and the guidance of Paulo to ensure a meaningful and unforgettable trip.**"
    },
    {
      "id": 5,
      "name": "Beach Vacation",
      "description": "A relaxing vacation at the beach",
      "location": "Hawaii",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 1,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Greenbuild Adventure: A Farm Stay with Paulo\n\n**Destination:** **Greenbuild International Conference and Expo, Las Vegas, USA**\n\n**Dates:** [Insert Dates of Greenbuild Conference]\n\n**Accommodation:** **The Farm at Tule Springs**, a certified sustainable farm hotel offering single rooms, located near Las Vegas, Nevada. \n\n**Transportation:**  **Bike** (personal bike or rental) for exploring the farm and local areas. **Public Transportation** (bus or rideshare) for getting to and from the Greenbuild conference center.\n\n**Guide:** **Paulo** (you can find local guides specializing in sustainable travel or contact Greenbuild for recommendations).\n\n**Package:** **Eco-Friendly Adventure**\n\n**Itinerary:**\n\n**Day 1: Arrival and Farm Immersion**\n\n* Arrive at McCarran International Airport (LAS) and take public transportation to The Farm at Tule Springs. \n* Check-in and settle into your single room. \n* Meet Paulo, your guide, for a welcome orientation and introduction to the farm's sustainable practices.\n* Enjoy a delicious vegetarian dinner made with fresh, locally-sourced ingredients.\n* Participate in an evening farm activity like a guided nature walk or a stargazing session.\n\n**Day 2: Greenbuild Conference**\n\n* Start your day with a healthy vegetarian breakfast prepared using farm-fresh produce.\n* Take public transportation to the Greenbuild International Conference and Expo.\n* Participate in a variety of engaging workshops, presentations, and networking opportunities throughout the day. \n* Enjoy a vegetarian lunch from the conference's food vendors. \n* After the conference, explore the Las Vegas Strip with Paulo, focusing on green initiatives and sustainable attractions. \n* Return to the farm by public transportation and enjoy a relaxing evening.\n\n**Day 3: Exploring the Farm and Local Sustainability**\n\n* After breakfast, take a guided bike tour of the farm with Paulo, learning about its sustainable farming practices and local conservation efforts.\n* Participate in a farm-to-table cooking class using freshly harvested vegetables.\n* Enjoy a delicious vegetarian lunch prepared from your cooking class experience.\n* In the afternoon, explore the nearby Red Rock Canyon National Conservation Area, focusing on the area's unique desert ecosystems and sustainable tourism efforts.\n* Return to the farm for a relaxing evening.\n\n**Day 4: Departure**\n\n* Enjoy a final vegetarian breakfast with the farm community.\n* Take public transportation to McCarran International Airport (LAS) for your departure.\n\n**Sustainable Practices:**\n\n* Staying at a sustainable farm hotel reduces your carbon footprint and supports local communities.\n* Using bikes and public transportation minimizes your reliance on cars and reduces emissions.\n* Eating vegetarian meals promotes animal welfare and reduces your environmental impact.\n* The Greenbuild Conference focuses on sustainable building practices and innovative solutions for environmental challenges.\n* Exploring local natural areas promotes appreciation for biodiversity and conservation efforts.\n\n**Notes:**\n\n* This itinerary is flexible and can be customized based on your interests and preferences.\n* You can find more information about the Greenbuild Conference and sustainable tourism in Las Vegas online.\n* Paulo can assist with finding local bike rentals and public transportation options.\n* Enjoy the experience of a truly sustainable travel adventure, immersing yourself in the natural beauty of the desert and contributing to a greener future. \n"
    },
    {
      "id": 6,
      "name": "Beach Vacation",
      "description": "A relaxing vacation at the beach",
      "location": "Hawaii",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 1,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Travel Itinerary: Greenbuild & Eco-Adventure\n\n**Destination:** **Greenbuild International Conference and Expo** (Location varies annually - you'll need to confirm the 2024 location)\n\n**Travel Style:** Eco-Friendly Adventure, Solo Traveler\n\n**Guide:** Paulo\n\n**Transportation:** Bike (personal or rental)\n\n**Accommodation:**  Farm Hotel (Single Room)\n\n**Meals:** Vegetarian\n\n**Package:** Eco-Friendly Adventure\n\n**Itinerary:**\n\n**Day 1:**\n\n* **Morning:** Arrival at the Greenbuild International Conference and Expo location. \n* **Afternoon:** Check-in at your chosen Farm Hotel. Explore the local farm and learn about their sustainable practices.\n* **Evening:** Enjoy a delicious vegetarian dinner prepared with fresh, locally sourced ingredients at the hotel.\n\n**Day 2:**\n\n* **Morning:** Attend Greenbuild International Conference and Expo sessions.\n* **Afternoon:** Guided bike tour with Paulo. Explore nearby eco-friendly attractions, such as organic farms, wildlife sanctuaries, or community gardens. \n* **Evening:**  Enjoy a vegetarian dinner at a local restaurant with a focus on sustainability.\n\n**Day 3:**\n\n* **Morning:** Attend Greenbuild International Conference and Expo workshops.\n* **Afternoon:** Free time to explore the local area or participate in a sustainable activity organized by the hotel (e.g., composting workshop, seed-saving activity).\n* **Evening:** Relax at the farm hotel and enjoy a final vegetarian dinner.\n\n**Day 4:**\n\n* **Morning:** Farewell breakfast at the Farm Hotel.\n* **Afternoon:** Depart from the Greenbuild International Conference and Expo location.\n\n**Accommodation:**\n\n* **Farm Hotel:** Choose from a variety of eco-friendly farm hotels worldwide. Some options include: \n    * **The Farm at Tremont, Virginia, USA:**  Offers single rooms and farm-to-table vegetarian meals.\n    * **Agriturismo Le Querce, Tuscany, Italy:**  Features a sustainable farm, single room options, and local cuisine. \n    * **The Green Farm, Oxfordshire, UK:**  Provides eco-friendly accommodations and organic meals. \n\n**Transportation:**\n\n* **Bike:**  Bring your own bike or rent a bike locally.  \n* **Public transportation:**  Consider utilizing public transportation to reach the Greenbuild International Conference and Expo location.\n\n**Tips for Sustainable Travel:**\n\n* **Pack light:**  Avoid unnecessary luggage to reduce your carbon footprint.\n* **Choose reusable water bottles and utensils:**  Reduce single-use plastic consumption.\n* **Minimize your impact:**  Be mindful of energy consumption and waste disposal. \n* **Support local businesses:**  Choose restaurants and shops that promote sustainable practices.\n* **Engage with the local community:**  Learn about local environmental initiatives and contribute to their efforts.\n\n**Note:** This itinerary is a suggestion and can be customized based on your interests and time constraints.  \n\nThis itinerary ensures you experience the best of Greenbuild while embracing sustainable practices. The combination of eco-friendly accommodation, vegetarian meals, and biking will minimize your environmental impact, while Paulo's guidance will help you discover local gems and learn about sustainability efforts in the area."
    },
    {
      "id": 7,
      "name": "Beach Vacation",
      "description": "A relaxing vacation at the beach",
      "location": "Hawaii",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 1,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Adventure to Greenbuild: A Farm-to-Table Experience\n\n**Destination:** **Greenbuild International Conference and Expo (Location TBD)**\n\n**Accommodation:** **Eco-Friendly Farm Hotels:**\n\n* **The Farm at Tassajara (California, USA):** A Zen Buddhist monastery offering simple, serene farm stays with vegetarian meals. \n* **The Little Farm (New Zealand):** An off-grid farmstay in the heart of New Zealand's wine country, with a focus on organic farming and sustainable living.\n* **The Green Farm (Italy):** A charming farm hotel nestled in the Tuscan countryside, offering farm-to-table cuisine and opportunities to participate in sustainable farming practices.\n* **Eco-Farmstay (Germany):** A family-run farm in the Black Forest, offering comfortable single rooms and a focus on organic farming and animal welfare. \n* **The Organic Farm (India):** An eco-friendly farm stay in the foothills of the Himalayas, promoting sustainable farming and traditional Indian hospitality.\n\n**Transportation:** **(transport.name) - Specify your preferred sustainable transport option.**\n\n* **Electric Bike:** For exploring local areas and getting to nearby attractions.\n* **Public Transportation:** Utilize local buses and trains for longer journeys.\n* **Train:** Consider a scenic train journey to your chosen destination.\n\n**Package:** **Eco-Friendly Adventure:**\n\n* **Guided Tours by Paulo:** Explore local markets, organic farms, and sustainable initiatives with a knowledgeable guide.\n* **Vegetarian Meals:** Enjoy delicious farm-to-table vegetarian meals, highlighting local and seasonal ingredients.\n* **Outdoor Adventures:**  Engage in eco-friendly activities like hiking, cycling, and kayaking, minimizing your environmental impact. \n* **Volunteer Opportunities:** Participate in sustainable farming practices or contribute to local environmental projects.\n* **Greenbuild International Conference and Expo:** Attend Greenbuild to gain insights into sustainable building practices and network with industry professionals.\n\n**Itinerary Example (Greenbuild in Chicago, USA):**\n\n**Day 1:**\n* Arrive at San Francisco Airport and transfer to The Farm at Tassajara (electric bike or public transportation).\n* Settle in and enjoy a vegetarian dinner prepared with fresh farm produce.\n* Participate in a guided meditation session.\n\n**Day 2:**\n* Explore the farm with Paulo, learning about organic farming practices and meeting the animals.\n* Enjoy a vegetarian lunch in the communal dining hall.\n* Participate in a volunteer activity, such as harvesting vegetables or helping with animal care.\n* Relax in the serene surroundings and enjoy a sunset yoga session.\n\n**Day 3:**\n* Take an electric bike tour through the scenic Tassajara Valley, visiting local farmers markets and enjoying the natural beauty.\n* Enjoy a delicious vegetarian picnic lunch prepared with fresh ingredients from the farm.\n* Head back to the farm and participate in a cooking class, learning to prepare traditional vegetarian dishes.\n* End the day with a peaceful evening meditation session.\n\n**Day 4:**\n* Depart from The Farm at Tassajara and transfer to San Francisco International Airport.\n* Fly to Chicago and check into your hotel (Sustainable Hotel options available in Chicago).\n* Explore downtown Chicago using public transportation and visit Millennium Park, a beautiful green space in the heart of the city.\n* Enjoy a vegetarian dinner at a local restaurant.\n\n**Day 5 - Day 7:**\n* Attend Greenbuild International Conference and Expo, engage in workshops and networking sessions.\n* Explore Chicago's sustainable initiatives, visiting green buildings and eco-friendly businesses.\n* Enjoy vegetarian meals at sustainable restaurants and explore the diverse culinary scene in Chicago.\n\n**Day 8:**\n* Depart from Chicago and return home.\n\n**Note:** This is a sample itinerary, and you can customize it based on your preferences and the location of Greenbuild. \n\n**Remember to research and choose eco-friendly farm hotels that align with your values and preferences. Also, ensure you have all the necessary permits and documentation for traveling with your electric bike.** \n\nHave a sustainable and fulfilling adventure! \n"
    },
    {
      "id": 8,
      "name": "Camping Vacation",
      "description": "A relaxing vacation at the camping ",
      "location": "London",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 1,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Travel Itinerary: Greenbuild & Farmstay Adventure\n\n**Destination:** **Greenbuild International Conference and Expo** in **Las Vegas, Nevada**, followed by a farmstay adventure in **Ojai, California**\n\n**Duration:** 10 days\n\n**Package:** Eco-Friendly Adventure\n\n**Accommodation:**\n\n* **Las Vegas:** **The Green Valley Ranch Resort** -  A LEED certified hotel offering a sustainable experience.\n* **Ojai:** **The Ojai Valley Inn & Spa** - A luxurious farm-to-table resort with a strong commitment to sustainability.\n\n**Transportation:**\n\n* **Las Vegas:**  **(transport.name)** - Sustainable transportation option in Las Vegas (e.g., electric car rental, public transportation, or rideshare services).\n* **Ojai:** **Bike** - Guided bike tours with your guide, Paulo, will allow you to explore the beautiful Ojai Valley.\n\n**Meals:**\n\n* **All meals will be vegetarian** focusing on locally sourced and organic ingredients. Farm-to-table dining will be a highlight of the Ojai experience. \n\n**Itinerary:**\n\n**Day 1:** \n\n* Arrival in Las Vegas and check into The Green Valley Ranch Resort.\n* Explore the resort's sustainable features and enjoy a vegetarian dinner at one of the resort's restaurants.\n\n**Day 2-3:**\n\n* **Greenbuild International Conference and Expo:**  Attend workshops, seminars, and exhibits focusing on sustainable building and design. \n* Network with industry professionals and learn about the latest advancements in green technology.\n* Enjoy vegetarian meals at the conference venue.\n\n**Day 4:**\n\n* **Transfer to Ojai:** Take a scenic drive or a sustainable transportation option to Ojai, California.\n* Check into The Ojai Valley Inn & Spa. \n* Enjoy a welcome vegetarian dinner featuring local produce.\n\n**Day 5-7:**\n\n* **Farmstay Adventure:**\n    * **Guided Bike Tours with Paulo:** Explore the Ojai Valley on your bike, visiting local farms, wineries, and scenic trails.\n    * **Sustainable Farm Activities:** Participate in hands-on farm activities like harvesting, planting, and tending to animals.\n    * **Farm-to-Table Dining:** Enjoy gourmet vegetarian meals prepared with fresh, locally sourced ingredients. \n    * **Relaxation and Wellness:**  Experience the resort's spa and enjoy treatments using natural ingredients. \n    * **Yoga and Mindfulness:**  Attend yoga sessions in the serene Ojai setting.\n\n**Day 8:**\n\n* **Free Day:**  Explore the town of Ojai at your leisure, visit the Ojai Art Center, or relax at the resort.\n* Enjoy a farewell vegetarian dinner at one of the resort's restaurants.\n\n**Day 9:**\n\n* **Departure:**  Transfer back to Las Vegas or your next destination.\n\n**Greenbuild & Farmstay Adventure Highlights:**\n\n* **Sustainable Living Experience:** Immerse yourself in a sustainable lifestyle through eco-friendly accommodations, transportation, and farm-to-table dining.\n* **Greenbuild Expertise:** Gain valuable insights and connections from the leading international conference on sustainable building and design.\n* **Outdoor Adventure:** Enjoy scenic bike rides through the Ojai Valley, exploring its natural beauty and local farms.\n* **Farm-to-Table Cuisine:**  Savor delicious vegetarian meals prepared with fresh, organic ingredients, highlighting the bounty of Ojai's agricultural landscape.\n* **Relaxation and Wellness:**  Rejuvenate your mind and body with spa treatments and mindfulness activities in a serene setting.\n\n**Notes:**\n\n* This itinerary can be customized to suit your interests and preferences.\n* The availability of transportation options and farm activities may vary depending on the time of year.\n* Book your Greenbuild registration and accommodations well in advance.\n* Contact The Ojai Valley Inn & Spa directly for farmstay program details and availability. \n* Inquire about the possibility of electric bike rentals for the guided tours with Paulo. \n\n**This itinerary offers a unique blend of sustainable living, educational opportunities, and outdoor adventures, creating a memorable and eco-conscious travel experience.** \n"
    },
    {
      "id": 9,
      "name": "Road Trip Vacation",
      "description": "A relaxing vacation",
      "location": "London",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 1,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Travel Itinerary: Greenbuild & Farmstay Adventure\n\n**Destination:** Tuscany, Italy\n\n**Accommodation:**  **Agriturismo Il Casale** (Farm Hotel) - Single room\n\n**Transportation:**  **(transport.name)** for arrival and departure, Bike for local travel\n\n**Meals:** Vegetarian, farm-to-table cuisine\n\n**Guide:** Paulo\n\n**Package:** Eco-Friendly Adventure\n\n**Itinerary:**\n\n**Day 1:**\n\n* **Morning:** Arrive at Florence Airport and transfer to **Agriturismo Il Casale**, a charming farm hotel nestled in the rolling hills of Tuscany.\n* **Afternoon:** Meet with Paulo, your guide, for a welcome bike tour of the surrounding countryside, exploring vineyards, olive groves, and charming villages. \n* **Evening:**  Enjoy a delicious vegetarian dinner featuring fresh, locally sourced ingredients at the farm.\n\n**Day 2:**\n\n* **Morning:**  Attend the **Greenbuild International Conference and Expo** in Florence.  Gain insights into sustainable building practices and connect with industry professionals.\n* **Afternoon:**  Guided bike tour through the heart of Florence, visiting iconic landmarks like the Ponte Vecchio and the Duomo, all while learning about the city's rich history and eco-friendly initiatives. \n* **Evening:**  Savor a traditional Tuscan vegetarian meal at a local trattoria.\n\n**Day 3:**\n\n* **Morning:**  Explore the nearby town of Siena, known for its beautiful Piazza del Campo and its annual Palio horse race.  Discover local artisan shops and explore the historical center.\n* **Afternoon:**  Return to the farm and enjoy a leisurely afternoon in the farm's gardens, learning about sustainable farming practices from the owner.\n* **Evening:**  A relaxing evening with a farm-to-table dinner, followed by stargazing in the Tuscan night sky.\n\n**Day 4:**\n\n* **Morning:**  Depart from Agriturismo Il Casale and transfer to Florence Airport for your onward journey.\n\n**Sustainability Features:**\n\n* **Eco-friendly Accommodation:**  Agriturismo Il Casale utilizes solar energy, compost toilets, and promotes sustainable farming practices.  Single room accommodations minimize your ecological footprint.\n* **Vegetarian Meals:**  Experience delicious vegetarian cuisine using fresh, local produce sourced from the farm or surrounding region.\n* **Bike Transportation:**  Reduce your carbon emissions and explore the beautiful Tuscan countryside on two wheels.\n* **Greenbuild International Conference and Expo:** Immerse yourself in the world of sustainable building and design, gaining valuable knowledge and networking with industry experts.\n* **Local Experiences:**  Engage with local culture, traditions, and communities, supporting sustainable tourism.\n\n**Package Details:**\n\nThe **Eco-Friendly Adventure** package includes:\n\n* Accommodation in a single room at Agriturismo Il Casale\n* Daily vegetarian breakfast, lunch, and dinner\n* Bike rental for the duration of your stay\n* Guided bike tours with Paulo\n* Entrance fees to Greenbuild International Conference and Expo\n* Transfer from Florence Airport to Agriturismo Il Casale and back\n\nThis itinerary offers a unique opportunity to experience the beauty of Tuscany while embracing sustainability. You will enjoy delicious vegetarian cuisine, explore the region by bike, and learn about sustainable practices at the farm and during the Greenbuild conference. By choosing this itinerary, you contribute to responsible travel and create lasting memories in a beautiful and environmentally conscious setting. \n"
    },
    {
      "id": 10,
      "name": "Road Trip Vacation",
      "description": "A relaxing vacation",
      "location": "London",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 1,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Travel Itinerary: Greenbuild and Eco-Adventure \n\n**Destination:**  **Italy** - **Tenuta di Anguillara**, a certified organic farm hotel nestled in the rolling hills near Rome.\n\n**Package:**  **Eco-Friendly Adventure** \n\n**Accommodation:** **Single Room** at Tenuta di Anguillara.\n\n**Transportation:** **Bike** (for local exploration) and **Train** (for travel to Greenbuild International Conference and Expo).\n\n**Guide:**  **Paulo** (will provide local insights and guidance)\n\n**Meals:** **Vegetarian**\n\n**Itinerary:**\n\n**Day 1:**\n\n* **Arrival in Rome:** Take a train from the airport to the charming town of Anguillara Sabazia, where you'll be greeted by Paulo.\n* **Check-in at Tenuta di Anguillara:**  Enjoy the welcoming ambiance of this eco-friendly farm hotel. Settle into your comfortable single room, surrounded by nature.\n* **Welcome Dinner:** Indulge in a delicious vegetarian dinner prepared with fresh, locally sourced ingredients from the farm.\n\n**Day 2:**\n\n* **Morning Exploration:**  Set off on a scenic bike ride through the countryside, exploring charming villages and enjoying breathtaking views. Paulo will guide you along the way, sharing local knowledge and stories. \n* **Farm Experience:**  Join a hands-on workshop at the farm, learning about sustainable farming practices and sampling the fruits of their labor.\n* **Relaxing Evening:**  Enjoy a leisurely dinner at the hotel, savoring the flavors of the local cuisine.\n\n**Day 3:**\n\n* **Greenbuild International Conference and Expo:**  Take a scenic train ride to Milan, where you'll attend Greenbuild, a global gathering of sustainability professionals. \n* **Expo Exploration:** Immerse yourself in the latest sustainable building technologies, innovations, and trends.\n* **Evening Stroll:** Enjoy a relaxing evening walk through Milan, discovering the city's vibrant atmosphere and culinary delights.\n\n**Day 4:**\n\n* **Greenbuild Conference:**  Continue your participation in Greenbuild, attending workshops and networking with industry leaders.\n* **Sustainable City Tour:**  Join a guided tour of Milan, focusing on its eco-friendly initiatives and sustainable urban development.\n* **Farewell Dinner:**  Enjoy a delicious vegetarian meal at a local restaurant, reflecting on the insights gained during your journey.\n\n**Day 5:**\n\n* **Departure:**  Take a train back to Rome and connect to your flight home, leaving with a renewed appreciation for sustainable living and travel.\n\n**Additional Information:**\n\n* This itinerary can be adapted based on your specific interests and time constraints.\n*  Tenuta di Anguillara offers a range of activities, including cooking classes, yoga sessions, and wine tastings.\n*  Paulo will be your knowledgeable guide, providing insights into local culture, history, and sustainable practices.\n*  Bike rentals are available at the hotel for exploring the surrounding countryside.\n\n**This eco-friendly adventure will allow you to experience the beauty of Italy while contributing to sustainable tourism and learning about innovative practices for a greener future.**\n"
    },
    {
      "id": 11,
      "name": "Viagem para Inglaterra Sustentavel",
      "description": "Viagem sustentavel pela Inglaterra ",
      "location": "Inglaterr",
      "placeID": 2,
      "accomodationID": 3,
      "transportationID": 2,
      "mealID": 4,
      "eventID": 2,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Eco-Friendly Adventure in the Canadian Rockies: An Earth Day Celebration with Paulo\n\n**Destination:** Banff National Park, Canada\n\n**Accommodation:** Lake Louise Inn, a family-friendly mountain hotel nestled in the heart of the Canadian Rockies.\n\n**Transportation:**  Bus (your favorite!)\n\n**Guide:**  Paulo (your experienced and knowledgeable guide)\n\n**Package:** Eco-Friendly Adventure\n\n**Dates:**  April 15th - April 22nd (Earth Day)\n\n**Itinerary:**\n\n**Day 1: Arrival & Settle in:**\n* Arrive at Calgary International Airport (YYC) and meet Paulo. \n* Board the bus for a scenic journey to Lake Louise Inn, where you'll check into your cozy room. \n* After settling in, enjoy a delicious vegetarian dinner at the inn's restaurant, featuring local and seasonal ingredients.\n* Relax and soak in the breathtaking views of the surrounding mountains.\n\n**Day 2: Hike & Explore:**\n* Begin the day with a guided hike to Lake Agnes Tea House, enjoying stunning views of the turquoise waters and surrounding peaks.\n* Enjoy a vegetarian lunch at the tea house, followed by a relaxing stroll back to the inn. \n* In the afternoon, learn about sustainable practices and ecological initiatives within Banff National Park with Paulo.\n\n**Day 3:  Earth Day Celebration:**\n* Celebrate Earth Day with a guided hike to Moraine Lake, known for its breathtaking turquoise beauty and iconic \"Twenty Dollar View.\" \n* Participate in a guided nature walk, focusing on the unique flora and fauna of the park. \n* Learn about the impact of climate change on the Canadian Rockies and discuss solutions for sustainable tourism with Paulo.\n* Enjoy a delicious vegetarian dinner at the inn, reflecting on the importance of environmental stewardship.\n\n**Day 4:  Adventure & Relaxation:**\n* Head out for a day of adventure! Choose from a variety of activities, including:\n    *  Canoeing or kayaking on Lake Louise. \n    *  Exploring the scenic trails around the inn on foot or by bike.\n    *  A visit to the Banff Springs Hotel for a guided tour of its historical architecture.\n* Enjoy a vegetarian picnic lunch amidst the stunning mountain scenery.\n* Relax at the inn's spa or indulge in a traditional Canadian evening with a campfire and stargazing.\n\n**Day 5:  Wildlife Safari & Cultural Immersion:**\n* Embark on a guided wildlife safari, searching for iconic Canadian wildlife like elk, deer, and bears. \n* Learn about the importance of wildlife conservation and the efforts to protect the park's diverse ecosystem.\n* After the safari, visit the Banff National Park Museum for a glimpse into the history and cultural significance of the region.\n* Enjoy a delicious vegetarian dinner featuring local specialties.\n\n**Day 6:  Scenic Drive & Farewell:**\n* Take a scenic drive along the Icefields Parkway, marveling at the breathtaking views of glaciers, waterfalls, and mountain vistas.\n* Stop at the Columbia Icefield for a unique experience on the Athabasca Glacier.\n* Enjoy a final vegetarian lunch before departing for Calgary International Airport (YYC) with fond memories of your eco-friendly adventure in the Canadian Rockies.\n\n**Sustainable Practices:**\n* **Accommodation:** Lake Louise Inn is committed to sustainable practices, including energy efficiency, waste reduction, and water conservation.\n* **Transportation:** The bus is a relatively low-emission mode of transportation, and Paulo will encourage sustainable travel practices throughout the trip.\n* **Meals:** All meals will be vegetarian, featuring fresh, locally sourced ingredients whenever possible, minimizing food miles and supporting local farmers.\n* **Experiences:** The itinerary emphasizes outdoor activities like hiking, canoeing, and wildlife viewing, promoting a connection with nature and encouraging responsible eco-tourism.\n\n**Paulo's Expertise:** \nPaulo will be your knowledgeable guide throughout the journey, sharing insights into the natural beauty, cultural significance, and sustainable practices of Banff National Park. He'll ensure you have a truly memorable and environmentally responsible experience.\n\n**This itinerary is just a suggestion, and it can be customized to your specific interests and preferences. Talk to Paulo about your vision for an unforgettable Earth Day adventure in the Canadian Rockies!**\n"
    },
    {
      "id": 12,
      "name": "Viagem para o Canada",
      "description": "Viagem sustentavel pelo Canada e seus territórios",
      "location": "Canad",
      "placeID": 2,
      "accomodationID": 3,
      "transportationID": 2,
      "mealID": 4,
      "eventID": 2,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Eco-Friendly Adventure: A National Park Escape with Paulo\n\n**Destination:** **Yellowstone National Park, Wyoming, USA**\n\n**Duration:** 7 Days\n\n**Travel Dates:** April 18th - April 24th (Earth Day is April 22nd!)\n\n**Accommodation:** **Old Faithful Inn** (a historic and family-friendly mountain hotel within the park)\n\n**Transportation:** **Bus**\n\n**Guide:** **Paulo**\n\n**Package:** **Eco-Friendly Adventure**\n\n**Itinerary:**\n\n**Day 1:** \n\n* **Arrival in Yellowstone:** Meet Paulo at the park entrance and board the bus for a scenic drive to Old Faithful Inn. Settle in and enjoy a delicious vegetarian dinner at the hotel restaurant.\n* **Evening Exploration:** Take a guided walk around the Old Faithful area, learning about the park's history, wildlife, and geothermal wonders. \n\n**Day 2:** \n\n* **Morning Hike:** Embark on a guided hike to the Upper Geyser Basin, marveling at the iconic Old Faithful and other geothermal features. Enjoy a vegetarian picnic lunch overlooking the geysers.\n* **Afternoon Wildlife Viewing:** Join Paulo for a wildlife tour by bus, searching for bison, elk, wolves, and other animals in their natural habitat.\n* **Evening Program:** Participate in a park ranger-led program focused on sustainable practices in Yellowstone.\n\n**Day 3:**\n\n* **Earth Day Celebration:** Join a park-organized Earth Day celebration, participating in activities like planting trees, cleaning trails, and learning about conservation efforts.\n* **Afternoon Hike:** Hike to the Grand Prismatic Spring, the park's largest hot spring, and learn about its colorful bacteria and geothermal processes.\n* **Dinner and Stargazing:** Enjoy a delicious vegetarian dinner at the hotel and afterwards, join Paulo for an evening of stargazing, learning about the constellations and the importance of protecting our night skies.\n\n**Day 4:**\n\n* **Morning Hike:** Embark on a guided hike to the Mammoth Hot Springs, exploring the travertine terraces and learning about their formation. \n* **Afternoon Exploration:** Take a scenic drive through Lamar Valley, known for its abundant wildlife, including wolves and grizzly bears.\n* **Evening Relaxation:** Relax in the hotel's cozy lounge or enjoy a book by the fireplace.\n\n**Day 5:**\n\n* **Morning Ride:** Enjoy a guided horseback riding tour through the park's meadows and forests, connecting with nature in a unique way.\n* **Afternoon Fishing:**  Learn the art of fly fishing in a pristine Yellowstone lake with Paulo, focusing on catch-and-release techniques for responsible fishing.\n* **Evening BBQ:**  Enjoy a vegetarian BBQ under the stars with Paulo, sharing stories and experiences from the trip.\n\n**Day 6:**\n\n* **Morning Hike:**  Hike to the Roosevelt Arch, a historic landmark marking the park's entrance, learning about the park's conservation history.\n* **Afternoon Exploration:**  Take a leisurely walk through the Hayden Valley, searching for wildlife and taking in the expansive views.\n* **Evening Farewell Dinner:** Share a final delicious vegetarian dinner with Paulo and your fellow travelers, reminiscing about your adventures.\n\n**Day 7:**\n\n* **Departure:** Enjoy breakfast at the hotel before departing Yellowstone National Park.\n\n**Sustainable Practices:**\n\n* Utilizing park shuttles and buses for transportation within the park.\n* Staying in a family-friendly mountain hotel with a focus on sustainability.\n* Choosing vegetarian meals to minimize your carbon footprint.\n* Participating in park activities that promote conservation and education.\n* Using reusable water bottles and reducing single-use plastics.\n* Leaving no trace behind while hiking and exploring the park.\n\n**Note:** This itinerary is just a suggestion and can be customized to your interests and needs. Paulo can provide recommendations and guidance on activities, hikes, and transportation options within the park. \n\nThis eco-friendly adventure in Yellowstone promises to be an unforgettable experience, allowing you to connect with nature, learn about sustainable practices, and celebrate Earth Day in a truly inspiring setting."
    },
    {
      "id": 13,
      "name": "Viagem para o Canada",
      "description": "Viagem sustentavel no canada",
      "location": "Canad",
      "placeID": 2,
      "accomodationID": 3,
      "transportationID": 2,
      "mealID": 4,
      "eventID": 2,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Eco-Friendly Adventure: Earth Day in the Mountains with Paulo\n\n**Destination:**  **Banff National Park, Canada**\n\n**Accommodation:** **The Fairmont Banff Springs** -  A historic mountain hotel with family-friendly amenities, known for its commitment to sustainability initiatives.\n\n**Transportation:**  **Bus** (You've got it!)\n\n**Guide:** **Paulo**\n\n**Package:** **Eco-Friendly Adventure**\n\n**Itinerary:**\n\n**Day 1:**\n\n* **Morning:** Arrive at Calgary International Airport (YYC) and take a scenic bus ride to Banff National Park. \n* **Afternoon:** Check into The Fairmont Banff Springs, explore the hotel's grounds and enjoy a vegetarian lunch at one of their restaurants.\n* **Evening:** Join Paulo for a guided hike to Johnston Canyon, marvel at the frozen waterfalls, and learn about the park's ecology. Enjoy a vegetarian dinner at a local restaurant.\n\n**Day 2: Earth Day Celebrations!**\n\n* **Morning:** Join Paulo for an exciting guided hike to Lake Louise, where you'll learn about the history of the area and its conservation efforts.\n* **Afternoon:** Participate in an Earth Day celebration at the Banff National Park Visitor Center. Enjoy live music, learn about sustainable practices, and engage in hands-on activities. \n* **Evening:** Enjoy a delicious vegetarian dinner at a restaurant with panoramic views of the mountains.\n\n**Day 3:**\n\n* **Morning:** Embark on a scenic bus ride to Moraine Lake, known for its stunning turquoise waters. Enjoy a leisurely walk along the lake shore and learn about the delicate alpine ecosystem.\n* **Afternoon:**  Engage in a sustainable activity like a guided wildlife tour or a nature photography workshop led by Paulo. \n* **Evening:**  Enjoy a farewell dinner at The Fairmont Banff Springs, reflecting on your eco-friendly adventure.\n\n**Day 4:**\n\n* **Morning:**  Depart from Banff National Park and take a bus back to Calgary International Airport (YYC).\n\n**Sustainable Practices:**\n\n* **Eco-Friendly Accommodation:**  The Fairmont Banff Springs is committed to sustainable practices, reducing waste, conserving energy, and using eco-friendly products.\n* **Responsible Transportation:** Bus travel is a more sustainable option compared to flying or driving individual vehicles.\n* **Local and Sustainable Food:**  Enjoy vegetarian meals prepared with locally sourced ingredients and support eco-conscious restaurants.\n* **Minimize Your Impact:**  Follow Leave No Trace principles, pack out all trash, stay on designated trails, and be mindful of the fragile environment.\n* **Educational Activities:** Participate in guided tours and activities that increase your understanding of the environment and its conservation.\n\nThis itinerary combines exciting adventures with sustainable practices, allowing you to celebrate Earth Day in a beautiful and meaningful way. You'll enjoy the magnificent landscapes of Banff National Park while supporting its conservation efforts and creating a positive impact on the environment. \n"
    },
    {
      "id": 14,
      "name": "peaceful",
      "description": "sunny",
      "location": "londo",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 3,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Adventure: Farm Stay, Greenbuild Expo & Train Travel\n\n**Destination:** **Greenbuild International Conference and Expo, Orlando, Florida, USA**\n\n**Travel Dates:**  **[Insert Preferred Dates]** \n\n**Package:** **Eco-Friendly Adventure**\n\n**Accommodation:** **Farm Stay:**\n\n* **[Farm Hotel Name 1]:** Located near Orlando, this eco-friendly farm offers single rooms, fresh farm-to-table cuisine, and opportunities to learn about sustainable farming practices. \n* **[Farm Hotel Name 2]:** Situated in the outskirts of Orlando, this farm stay features single room accommodations, a focus on organic gardening, and farm-to-table meals.\n\n**Transportation:** **Train**\n\n* **Amtrak:**  Travel comfortably and sustainably by train to and from Orlando. Amtrak offers frequent service to Orlando from major cities across the United States.\n\n**Guide:** **Paulo Gomes**\n\n* **[Local Guide Agency/Contact Info]:** Paulo Gomes, a passionate and knowledgeable guide, will accompany you on your journey, providing insights into the region's sustainable practices and cultural experiences.\n\n**Activities & Itinerary:**\n\n**Day 1:**\n\n* **Arrival in Orlando:** Take the train to Orlando and check into your chosen Farm Stay.\n* **Welcome Dinner:**  Enjoy a delicious farm-fresh dinner featuring the local specialty, kuru fasulye, while learning about the farm's sustainable practices.\n* **Evening Stroll:** Explore the nearby area, taking in the beauty of the Florida landscape and enjoying the tranquility of farm life.\n\n**Day 2:**\n\n* **Greenbuild International Conference & Expo:**  Attend the renowned Greenbuild Conference and Expo, immersing yourself in the latest innovations and discussions on sustainable building practices. \n* **Networking Event:** Connect with fellow sustainability advocates and professionals during an evening networking event.\n* **Sustainable Dinner:** Enjoy a delicious dinner featuring local, sustainably sourced ingredients.\n\n**Day 3:**\n\n* **Sustainable Farm Tour:** Embark on a guided tour of the farm, learning about their composting methods, water conservation techniques, and organic farming practices.\n* **Cooking Demonstration:**  Participate in a hands-on cooking demonstration using fresh, seasonal farm produce.\n* **Relaxing Evening:** Unwind at the farm, enjoying the peace and tranquility of the countryside.\n\n**Day 4:**\n\n* **Departure from Orlando:**  Take the train from Orlando to your next destination. \n\n**Additional Activities:**\n\n* **Outdoor Adventures:** Participate in sustainable outdoor activities like hiking, kayaking, or biking in the nearby natural areas.\n* **Local Markets:** Visit local farmers markets to experience the vibrant food scene and purchase fresh, locally-sourced products.\n* **Cultural Experiences:** Explore the local culture and history, visiting museums, art galleries, and historical sites.\n\n**This itinerary is a customizable framework. You can tailor it to your specific interests and preferences, including: **\n\n* **Adding more days to explore the surrounding area.**\n* **Incorporating additional sustainable activities like visiting a local eco-friendly business.**\n* **Focusing on specific areas of interest within the Greenbuild conference.**\n\n**Remember to pack light, choose sustainable clothing options, and reduce your plastic consumption to minimize your environmental impact.**\n\n**Enjoy your sustainable adventure!** \n"
    },
    {
      "id": 15,
      "name": "peaceful",
      "description": "sunny",
      "location": "londo",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 3,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Travel Itinerary: Eco-Friendly Adventure with Greenbuild\n\n**Destination:** **Greenbuild International Conference and Expo** (Location varies each year, check website for specifics)\n\n**Accommodation:** \n\n* **Farm Hotel:** We will find a farm hotel in close proximity to the Greenbuild conference location, prioritizing organic farming practices and sustainable design. This will ensure an authentic rural experience while minimizing your environmental impact.\n* **Single Room:** You will enjoy a private and comfortable room with all necessary amenities.\n\n**Transportation:** \n\n* **Train:** We will utilize train travel as the primary mode of transport, as it is a highly sustainable option. \n* **(transport.name):** We will use your preferred transportation method, (transport.name) within the city for short-distance travel.\n\n**Guide:** \n\n* **Paulo Gomes:** Your experienced guide, Paulo Gomes, will accompany you throughout the journey, ensuring a smooth and insightful experience.\n\n**Package:** \n\n* **Eco-Friendly Adventure:** This package emphasizes responsible travel,  combining Greenbuild conference attendance with immersive farm experiences and outdoor activities that minimize environmental impact.\n\n**Itinerary:**\n\n**Day 1:**\n\n* **Arrival:** Arrive at the Greenbuild conference location. \n* **Transfer:** Travel by train to the farm hotel.\n* **Welcome:** Check in to your single room and enjoy a warm welcome with local hospitality. \n* **Farm Tour:** Embark on a guided tour of the farm, learning about sustainable farming techniques and organic produce.\n* **Dinner:** Enjoy a delicious dinner featuring \"kuru fasulye\" (Turkish white bean stew) prepared with locally sourced ingredients.\n\n**Day 2:**\n\n* **Greenbuild Conference:** Attend the Greenbuild conference, engaging with experts and exploring the latest advancements in sustainable building and design.\n* **Sustainable Practices Workshop:** Participate in a hands-on workshop focused on implementing sustainable practices in daily life.\n* **Local Market:** Visit a local farmers market to experience local culture and purchase fresh, organic produce.\n* **Dinner:** Enjoy a farm-to-table meal at the hotel, savoring the flavors of local cuisine.\n\n**Day 3:**\n\n* **Eco-Adventure:** Embark on an exciting eco-adventure, such as a nature hike, bike ride, or kayaking expedition.\n* **Sustainable Living:**  Learn about local initiatives and participate in a sustainable living project, such as tree planting or waste reduction.\n* **Farewell Dinner:**  Share a final meal with Paulo Gomes and enjoy a traditional farewell feast.\n\n**Day 4:**\n\n* **Departure:** Travel by train from the farm hotel to the Greenbuild conference location and depart for your next destination.\n\n**Note:** This itinerary is customizable based on your preferences and the availability of local activities and transportation. Paulo Gomes will be your guide in tailoring the experience to your interests and ensuring a smooth and memorable journey.\n\n**Greenbuild Conference Information:**\n\n* Visit the official Greenbuild website for the latest information on the conference dates, location, and agenda.\n* Greenbuild offers a variety of educational sessions, networking opportunities, and sustainable product demonstrations.\n* You can choose from various conference packages depending on your needs and interests.\n\n**Eco-Friendly Resort Selection:**\n\n* We will research and select a farm hotel that aligns with your sustainability values.\n* We will consider factors such as organic farming practices, renewable energy usage, water conservation, and waste management. \n* We will prioritize hotels with positive environmental impact and local community engagement.\n\nThis itinerary provides a framework for a sustainable and enriching travel experience. By incorporating your preferred transportation method, the \"kuru fasulye\" meal, and the expertise of your guide, Paulo Gomes, this Eco-Friendly Adventure will leave a lasting impression while minimizing your footprint on the environment."
    },
    {
      "id": 1,
      "name": "Viagem Itinerario",
      "description": "Itinerario de Viagem sustentavel pelo Canada",
      "location": "Canada",
      "placeID": 2,
      "accomodationID": "5",
      "transportationID": 3,
      "mealID": 4,
      "eventID": 2,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Earth Day Eco-Adventure: Train Trip to Yellowstone National Park\n\n**Sustainable Travel Itinerary with Guide Paulo Gomes**\n\n**Destination:** Yellowstone National Park, USA\n\n**Dates:** April 15-22 (Earth Day on April 22nd)\n\n**Accommodation:** Single Room in Eco-Friendly Hostels\n\n**Transportation:** Train (Amtrak)\n\n**Meals:** Vegetarian \n\n**Guide:** Paulo Gomes\n\n**Package:** Eco-Friendly Adventure\n\n**Day 1: Arrival in Yellowstone**\n\n* Arrive at the nearest Amtrak station to Yellowstone National Park (likely Gardiner, MT).\n* Meet Guide Paulo Gomes for a welcome briefing and sustainable travel tips.\n* Check into your single room at the eco-friendly hostel in Gardiner.\n* Enjoy a delicious vegetarian dinner at a local restaurant committed to sustainable practices.\n\n**Day 2: Yellowstone’s Wild Wonders**\n\n* Start the day with a hearty vegetarian breakfast at the hostel.\n* Embark on a guided hike to explore the Upper Geyser Basin, home to Old Faithful and other mesmerizing geothermal wonders. \n* Learn about Yellowstone’s unique ecosystem and the conservation efforts in place.\n* Enjoy a picnic lunch with locally sourced, vegetarian ingredients while enjoying breathtaking views. \n* Take a scenic drive through the Lamar Valley to observe wildlife like bison, elk, and wolves.\n* Relax and recharge with a vegetarian dinner at a local restaurant in Gardiner.\n\n**Day 3: Earth Day Celebration and Wildlife Encounters**\n\n* Join a special Earth Day celebration hosted by Yellowstone National Park, focused on environmental conservation and sustainable living.\n* Engage in a volunteer activity to support the park’s conservation efforts (e.g., trail cleanup, seed planting). \n* Head to Mammoth Hot Springs to witness the stunning travertine terraces formed by geothermal activity. \n* Take a guided wildlife tour in the Hayden Valley, known for its large bison herds and other wildlife.\n* Enjoy a vegetarian picnic lunch amidst the stunning natural scenery. \n* Reflect on the day's experiences and the importance of environmental responsibility.\n\n**Day 4: Majestic Landscapes and Hot Springs**\n\n* Travel by train to West Yellowstone, Montana, for a change of scenery.\n* Explore the Grand Prismatic Spring, one of the most vibrant and iconic sights in Yellowstone.\n* Immerse yourself in the beauty of the Firehole Canyon Drive, showcasing cascading waterfalls and lush forests.\n* Indulge in a relaxing soak in a natural hot spring (with a designated vegetarian option) at a nearby resort.\n* Savor a delicious vegetarian dinner at a local restaurant in West Yellowstone.\n\n**Day 5: Grand Canyon of Yellowstone and Bison Encounters**\n\n* Begin the day with a scenic drive through the Grand Canyon of Yellowstone, marveling at the dramatic cliffs and powerful waterfalls.\n* Take a guided hike along the rim of the canyon, enjoying panoramic views of the Yellowstone River.\n* Visit the Upper Falls and Lower Falls for close-up views of these impressive natural wonders.\n* Embark on a guided horseback riding tour through the Lamar Valley, offering unique perspectives on Yellowstone’s diverse wildlife.\n* Celebrate the evening with a relaxing vegetarian dinner at a local restaurant.\n\n**Day 6: The Beauty of the Blacktail Deer Plateau**\n\n* Take a guided hike through the Blacktail Deer Plateau, known for its diverse plant life and panoramic views.\n* Learn about the different types of trees and wildflowers found in this unique area. \n* Enjoy a vegetarian picnic lunch with breathtaking views.\n* Explore the nearby Lake Yellowstone, the largest high-altitude lake in North America, and admire the stunning views of the surrounding mountains.\n* Return to your hostel in Gardiner for a well-deserved rest. \n\n**Day 7: Departure from Yellowstone**\n\n* Enjoy a final vegetarian breakfast at the hostel.\n* Take a leisurely walk through Gardiner, soaking in the charm of this historic town.\n* Head to the Amtrak station to board your train for your onward journey.\n* Reflect on your incredible journey through Yellowstone National Park and the importance of sustainable travel.\n\n**Note:**\n\nThis itinerary is a suggestion and can be adjusted to your preferences. Remember to pack eco-friendly gear and follow sustainable practices throughout your trip.\n\n**Paulo Gomes**\n\nPaulo Gomes is an experienced naturalist guide with a passion for Yellowstone National Park and sustainable travel. He will provide you with in-depth knowledge about the park's history, ecology, and conservation efforts, ensuring a fulfilling and educational experience.\n\n**Sustainability Focus:**\n\n* This itinerary prioritizes eco-friendly accommodations, sustainable transportation options, and locally sourced, vegetarian meals.\n* You will be encouraged to minimize your environmental impact through responsible tourism practices, such as following Leave No Trace principles and supporting local businesses committed to sustainability.\n\n**This Earth Day, embark on a sustainable adventure to Yellowstone National Park and experience the beauty of nature while making a positive impact on the planet.**"
    },
    {
      "id": 15,
      "name": "Itinerario de viagem",
      "description": "Viagem sustentavel para o Canada",
      "location": "Canada",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 3,
      "mealID": 4,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Adventure to Greenbuild: A Train Journey Through Eco-Luxury\n\nThis itinerary combines a sustainable travel experience with a visit to Greenbuild International Conference and Expo, focusing on eco-friendly accommodation, vegetarian meals, and responsible transportation. \n\n**Destination:**  **[Choose your preferred location for Greenbuild, e.g., Toronto, Chicago, etc.]**\n\n**Duration:** **[Choose desired length, e.g., 7 days, 10 days, etc.]**\n\n**Accommodation:** \n\n* **Farm Hotel [Location, specific hotel name]** -  A certified eco-friendly farm hotel with sustainable practices.\n* **[Location, specific hotel name]** - Another sustainable option for your chosen Greenbuild location.\n\n**Transportation:**\n\n* **Train:**  [Choose your preferred train company, e.g., Amtrak in the USA, Eurostar in Europe, etc.]\n* **Local transport:**  Sustainable options like public buses, cycling, or walking where applicable.\n\n**Meals:**\n\n* Vegetarian meals with locally sourced ingredients will be provided by the farm hotel and other sustainable restaurants.\n\n**Guide:**\n\n* **Paulo Gomes** - [Choose the specific skills and expertise of Paulo, e.g., sustainable living expert, nature guide, etc.]\n\n**Itinerary:**\n\n**Day 1:**\n\n* Arrive at [Train Station] and transfer to the farm hotel.\n* Settle in, enjoy a welcome vegetarian meal, and explore the farm's sustainable practices.\n* Enjoy a guided tour of the surrounding area, including nearby nature reserves or sustainable agriculture projects.\n\n**Day 2:**\n\n* Breakfast at the farm, followed by a guided workshop on [Specific topic, e.g., permaculture, composting, etc.]. \n* Travel by train to [City, Greenbuild location] and check into your sustainable accommodation. \n* Free evening to explore the city.\n\n**Day 3:**\n\n* Visit Greenbuild International Conference and Expo - attend sessions, network, and discover new sustainable technologies and practices.\n* Enjoy a vegetarian lunch at a local sustainable restaurant recommended by Paulo.\n* Evening free for exploration or cultural experiences.\n\n**Day 4:**\n\n* Continue attending Greenbuild events and explore the exhibition hall.\n* Participate in a guided walking tour of [City location], focusing on local sustainable initiatives.\n* Enjoy a vegetarian dinner at a restaurant with a focus on locally sourced produce.\n\n**Day 5:**\n\n* Attend workshops or presentations at Greenbuild, focusing on specific areas of interest.\n* Visit a local sustainable community or project for a deeper understanding of practical solutions.\n* Enjoy a relaxing evening meal at your accommodation.\n\n**Day 6:**\n\n* Take a day trip to explore nearby natural landscapes, focusing on sustainable tourism activities.\n* Enjoy a picnic lunch prepared with farm-fresh ingredients.\n* Reflect on your experience and discuss future steps for sustainable living.\n\n**Day 7:**\n\n* Departure.\n\n**Additional Notes:**\n\n* This itinerary is a customizable template and can be adapted based on your individual interests, preferences, and budget.\n* Consider researching specific sustainable hotels, restaurants, and activities in your chosen location for Greenbuild.\n* Explore local transportation options, prioritizing sustainable alternatives.\n* Pack lightly and minimize waste by using reusable items and opting for eco-friendly products.\n* Engage with local communities and learn about their sustainable practices.\n* Share your experiences and encourage others to embrace sustainable travel!\n\n**Enjoy your sustainable adventure to Greenbuild!**"
    },
    {
      "id": 16,
      "name": "Viagem Sustentavel 2024",
      "description": "Viagem sustentavel pelo Canada em 2024",
      "location": "Canada",
      "placeID": 1,
      "accomodationID": "5",
      "transportationID": 3,
      "mealID": 4,
      "eventID": 1,
      "guideID": 2,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Travel Itinerary: Greenbuild & Eco-Adventure with Claire Redfield\n\n**Destination:** **Greenbuild International Conference and Expo**, held in various locations globally, with a focus on **eco-friendly resorts** and **train travel**.\n\n**Accommodation:** **Sustainable Hostels** offering single rooms, prioritizing eco-friendly practices like solar power, rainwater harvesting, and locally sourced materials. \n\n**Guide:** **Claire Redfield**, renowned for her sustainable travel expertise and outdoor adventure skills.\n\n**Transportation:** **Train travel**, a sustainable and scenic way to explore diverse landscapes.\n\n**Meals:** **Vegetarian**, highlighting local and seasonal produce, promoting sustainable farming and reducing carbon footprint.\n\n**Package:** **Eco-Friendly Adventure**\n\n**Itinerary:**\n\n**Day 1:**\n\n* Arrive at the Greenbuild International Conference and Expo city.\n* Check into your sustainable hostel and settle in.\n* Meet Claire Redfield, your guide for the trip, and discuss the itinerary. \n* Enjoy a vegetarian dinner featuring local produce at a sustainable restaurant. \n* Attend the opening ceremony of Greenbuild, immersing yourself in the latest sustainable building innovations.\n\n**Day 2:**\n\n* Explore the city with Claire Redfield, taking a sustainable walk or bike ride.\n* Visit local eco-friendly projects and learn about their impact on the community.\n* Enjoy a vegetarian lunch at a local farm-to-table restaurant.\n* Attend workshops and presentations at Greenbuild, focusing on topics that interest you.\n* Relax and enjoy a vegetarian dinner at a sustainable restaurant in the evening.\n\n**Day 3:**\n\n* Embark on a scenic train journey to a nearby national park or eco-friendly destination.\n* Enjoy the picturesque views and learn about the local flora and fauna from Claire Redfield.\n* Pack a vegetarian picnic lunch to enjoy at a scenic spot.\n* Experience an outdoor adventure activity like hiking, kayaking, or birdwatching.\n* Relax and enjoy a vegetarian dinner at a local restaurant near your accommodation.\n\n**Day 4:**\n\n* Enjoy a leisurely morning exploring the local area.\n* Participate in a sustainable volunteering opportunity to give back to the community.\n* Enjoy a delicious vegetarian lunch at a local restaurant.\n* Return to the Greenbuild International Conference and Expo city by train.\n* Attend the closing ceremony and network with fellow sustainability enthusiasts.\n* Enjoy a farewell vegetarian dinner with Claire Redfield and your fellow travelers.\n\n**Day 5:**\n\n* Depart from the Greenbuild city with new knowledge, lasting memories, and a deeper appreciation for sustainable living. \n\n**This itinerary is flexible and can be customized to fit your interests and budget.** You can choose from various eco-friendly resorts, train routes, and outdoor adventure activities to create your perfect sustainable travel experience.  \n\n**Sustainability Considerations:**\n\n* **Accommodation:** Choose hostels with eco-friendly practices like solar power, water conservation, and waste reduction.\n* **Transportation:** Travel by train, minimizing carbon emissions and enjoying scenic views. \n* **Food:** Opt for vegetarian meals, supporting local and sustainable farms.\n* **Activities:** Choose outdoor activities that minimize environmental impact, like hiking, kayaking, or birdwatching.\n* **Respect:** Show respect for the local culture, environment, and wildlife.\n\n**Remember:** This itinerary is a starting point. You can customize it to create your own unique and sustainable adventure.  Enjoy your journey with Claire Redfield and discover the beauty of the world while minimizing your impact on the planet! \n"
    },
    {
      "id": 17,
      "name": "Viagem Sustentavel 2024",
      "description": "Viagem sustentavel pelo Canada em 2024",
      "location": "Canada",
      "placeID": 1,
      "accomodationID": "5",
      "transportationID": 3,
      "mealID": 4,
      "eventID": 1,
      "guideID": 2,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Eco-Friendly Adventure: Greenbuild International Conference & Expo with Claire Redfield\n\n**Destination:**  **Greenbuild International Conference & Expo, various locations (rotating annually)**\n\n**Travel Style:** Sustainable, solo, vegetarian, with a focus on eco-friendly accommodations and train travel.\n\n**Guide:** Claire Redfield (fictional character from the Resident Evil video game series,  we can imagine her as a passionate environmental advocate and experienced guide)\n\n**Itinerary:**\n\n**Day 1:** \n* **Travel:** Depart from your starting point and arrive at the city where the Greenbuild International Conference & Expo is taking place.\n* **Accommodation:** Check into an eco-friendly hostel with single-room accommodation.\n* **Meals:** Enjoy a delicious vegetarian dinner at a local restaurant known for its sustainable practices.\n\n**Day 2:** \n* **Greenbuild:** Attend the Greenbuild International Conference & Expo, immersing yourself in the latest sustainable building technologies and practices. \n* **Guided Tour:** Join Claire Redfield for a walking tour of the city, focusing on green spaces, sustainable infrastructure, and local initiatives promoting eco-friendly living.\n* **Meals:** Vegetarian lunch and dinner at sustainable restaurants.\n\n**Day 3:**\n* **Local Sustainability:** Explore a nearby eco-village or sustainable farm, learning about community-based initiatives and permaculture practices. \n* **Transportation:** Take a scenic train ride to a nearby town or natural area.\n* **Meals:** Enjoy a vegetarian picnic lunch at a scenic park or forest.\n\n**Day 4:**\n* **Outdoor Adventure:**  Engage in an eco-friendly outdoor adventure, such as hiking, cycling, or kayaking, focusing on minimal environmental impact.\n* **Accommodation:**  Return to the eco-friendly hostel for the night.\n* **Meals:** Vegetarian dinner at a local restaurant known for its organic ingredients.\n\n**Day 5:**\n* **Greenbuild:** Continue exploring the Greenbuild International Conference & Expo, attending workshops and networking with professionals. \n* **Farewell Dinner:** Share a final vegetarian meal with Claire Redfield, reflecting on the experience and discussing future sustainable practices.\n\n**Day 6:**\n* **Departure:**  Take the train back to your starting point, filled with new knowledge and inspiration to live more sustainably.\n\n**Transportation:**\n\n* Train travel: Enjoy scenic train journeys and minimize your carbon footprint.\n* Local transportation: Utilize public transportation, cycling, or walking where possible.\n\n**Accommodation:**\n\n* Eco-friendly hostels: Choose hostels that prioritize sustainability with features like energy-efficient design, renewable energy sources, and waste reduction programs.\n\n**Meals:**\n\n* Vegetarian cuisine: Explore delicious vegetarian options at local restaurants and cafes focusing on organic and locally sourced ingredients.\n\n**This itinerary is just a framework, and you can customize it based on your interests and the specific location of the Greenbuild International Conference & Expo.** Remember to research and choose eco-friendly options for every aspect of your trip, from transportation and accommodation to dining and activities. \n\n**Enjoy your sustainable and inspiring journey!**\n"
    },
    {
      "id": 18,
      "name": "Viagem Sustentavel 2024",
      "description": "Viagem sustentavel pelo Canada em 2024",
      "location": "Canada",
      "placeID": 1,
      "accomodationID": "5",
      "transportationID": 3,
      "mealID": 4,
      "eventID": 1,
      "guideID": 2,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Greenbuild & Eco-Adventure with Claire Redfield: A Sustainable Travel Itinerary\n\n**Location:** Portland, Oregon, USA (Greenbuild International Conference & Expo)\n\n**Package:** Eco-Friendly Adventure\n\n**Transportation:** Train (Amtrak)\n\n**Accommodation:** Eco-friendly Hostel with Single Room Option\n\n**Guide:** Claire Redfield\n\n**Meal Plan:** Vegetarian\n\n**Day 1: Arrival & Greenbuild Exploration**\n\n* **Morning:** Arrive in Portland, OR. Board the Amtrak train to Portland Union Station.\n* **Afternoon:** Check into your single room at a centrally located, eco-friendly hostel. Leave your luggage and head to the Greenbuild International Conference & Expo.\n* **Evening:** Join Claire Redfield for a guided walk through downtown Portland, visiting local green initiatives and sustainable businesses. Enjoy a delicious vegetarian dinner at a restaurant known for its commitment to local and organic ingredients.\n\n**Day 2: City Exploration & Green Initiatives**\n\n* **Morning:**  Attend Greenbuild sessions and explore the exhibition hall, gaining insights into sustainable building practices. \n* **Afternoon:** Join Claire Redfield for a guided tour of the Portland International Rose Test Garden, showcasing sustainability practices in a beautiful natural setting. Afterward, have lunch at a vegetarian-friendly cafe near the garden.\n* **Evening:** Take a leisurely stroll along the Willamette River, enjoying the city's skyline. Indulge in a locally sourced vegetarian dinner at a trendy restaurant with a focus on sustainable practices. \n\n**Day 3: Eco-Adventure: Hiking & Scenic Beauty**\n\n* **Morning:**  Take a morning train ride to the Columbia River Gorge National Scenic Area.\n* **Afternoon:**  Join Claire Redfield on a guided hike through the scenic Multnomah Falls, immersing yourself in the beauty of nature. Enjoy a picnic lunch with vegetarian options, prepared with sustainable practices.\n* **Evening:** Return to Portland by train and enjoy a farewell dinner at a restaurant with a rooftop garden, highlighting local and sustainable cuisine. \n\n**Day 4: Departure**\n\n* **Morning:**  Enjoy a final breakfast at your hostel. \n* **Afternoon:** Head to the train station and board the Amtrak train for your departure.\n\n**Accommodation Options:**\n\n* **The Jupiter NEXT Hostel:** A contemporary, eco-friendly hostel located in the heart of downtown Portland. They offer single rooms with a focus on sustainability.\n* **The Green Tortoise Hostel:** Another eco-conscious option, known for its community atmosphere and focus on sustainable practices. They offer various room types including single rooms.\n\n**Food Recommendations:**\n\n* **The Vegetarian Restaurant:** Offers a wide range of delicious vegetarian dishes with an emphasis on organic and local ingredients.\n* **Harvest at the Fields:** Known for its farm-to-table approach, this restaurant features a seasonal menu with vegetarian options.\n* **The Green Room:** This cozy café provides a wide selection of vegetarian sandwiches, salads, and soups, using locally sourced ingredients.\n\n**Transportation:**\n\n* **Amtrak Cascades:**  Provides reliable and scenic train service between Portland and the Columbia River Gorge National Scenic Area.\n\n**Sustainable Practices:**\n\n* **Choose eco-friendly accommodation:** Stay at hostels or hotels with certifications like LEED or Green Key.\n* **Embrace public transportation:** Utilize the train (Amtrak) for travel within Portland and to the Columbia River Gorge.\n* **Support local businesses:**  Dine at restaurants with a focus on local, organic, and sustainable ingredients.\n* **Reduce your carbon footprint:**  Minimize air travel, prioritize train travel, and choose activities with a low environmental impact.\n* **Pack sustainably:** Bring reusable water bottles, bags, and other eco-friendly accessories. \n* **Be mindful of waste:** Dispose of waste properly, recycle whenever possible, and use reusable items.\n\n**With Claire Redfield's guidance, you can enjoy this Eco-Friendly Adventure while exploring Portland and learning about sustainable practices, leaving a minimal impact on the environment.**"
    },
    {
      "id": 19,
      "name": "Viagem Sustentavel 2024",
      "description": "Viagem sustentavel pelo Canada em 2024",
      "location": "Canada",
      "placeID": 1,
      "accomodationID": "5",
      "transportationID": 3,
      "mealID": 4,
      "eventID": 1,
      "guideID": 2,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Travel Itinerary: Greenbuild & Eco-Adventure with Claire Redfield\n\n**Destination:**  Greenbuild International Conference and Expo, various locations (dates vary)\n\n**Accommodation:** Single room at eco-friendly hostels\n\n**Transportation:** Train (local and long-distance)\n\n**Food:** Vegetarian meals at eco-friendly restaurants and cafes\n\n**Guide:** Claire Redfield (fictional character, can be adapted to a real-life eco-tour guide)\n\n**Package:** Eco-Friendly Adventure\n\n**Itinerary:**\n\n**Day 1:**\n\n* Arrive at Greenbuild conference city and check into your single room at an eco-friendly hostel.\n* Enjoy a vegetarian dinner at a locally-sourced restaurant, discussing the day's Greenbuild highlights with Claire.\n* Relax and explore the hostel's sustainable practices, like composting or rainwater harvesting.\n\n**Day 2:**\n\n* Attend the Greenbuild conference, focusing on sessions related to sustainable tourism and eco-friendly living.\n* Take a guided tour with Claire to a nearby urban farm or community garden, learning about local sustainable initiatives.\n* Have a vegetarian lunch at a farm-to-table restaurant with stunning views.\n* Enjoy a relaxing evening at the hostel, sharing stories and insights with fellow travelers.\n\n**Day 3:**\n\n* Take a scenic train ride to a nearby national park or protected area.\n* Enjoy a guided hike with Claire through the beautiful landscapes, learning about local flora and fauna.\n* Have a picnic lunch with fresh, locally sourced vegetarian food.\n* Relax by a nearby lake or stream, enjoying the natural beauty of the area.\n* Return to the city by train and enjoy a delicious vegetarian dinner at a cozy restaurant.\n\n**Day 4:**\n\n* Continue exploring the city with Claire, visiting green buildings and sustainable businesses.\n* Participate in a local volunteer activity like planting trees or cleaning up a park.\n* Enjoy a vegetarian lunch at a rooftop garden cafe.\n* Spend the evening at a local farmers' market, sampling fresh, seasonal produce.\n\n**Day 5:**\n\n* Depart from the city by train, taking in the views and reflecting on the Greenbuild experience.\n\n**Eco-Friendly Considerations:**\n\n* **Accommodation:** Choose hostels with certifications like LEED or EarthCheck, demonstrating their commitment to sustainability.\n* **Transportation:** Prioritize train travel for reduced emissions and enjoyment of the scenery.\n* **Food:** Opt for vegetarian meals with locally-sourced ingredients, supporting local farmers and reducing carbon footprint.\n* **Experiences:** Engage in eco-friendly activities like hiking, cycling, or visiting nature reserves.\n* **Waste Management:** Reduce waste generation by using reusable water bottles, bags, and cutlery.\n* **Ethical Consumption:** Support eco-conscious businesses and services, promoting a circular economy.\n\n**This itinerary can be customized:**\n\n* **Destination:** Choose a Greenbuild location that aligns with your interests and travel style.\n* **Accommodation:** Explore other sustainable accommodation options like eco-lodges or treehouses.\n* **Activities:** Add other eco-friendly experiences like kayaking, bird watching, or visiting renewable energy projects.\n* **Duration:** Extend or shorten the trip based on your available time and budget.\n\n**Remember:**\n\n* Pack sustainably and consider bringing your own reusable items.\n* Be mindful of your impact on the environment and local communities.\n* Respect local customs and traditions.\n* Embrace the journey and enjoy the sustainable adventure!"
    },
    {
      "id": 20,
      "name": "Viagem sustentavel 2025",
      "description": "Fazendo uma viagem viagem sustentavel em 2025 pelo Canada",
      "location": "Canada",
      "placeID": 1,
      "accomodationID": "5",
      "transportationID": 3,
      "mealID": 4,
      "eventID": 2,
      "guideID": 2,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Earth Day Adventure with Claire Redfield: Train Edition\n\n**Destination:** Costa Rica - **Eco-Friendly Resort:** Pacuare River Lodge\n\n**Accommodation:** Single room in a sustainable hostel near the lodge\n\n**Transportation:** Train (as much as possible) with local transportation options as needed\n\n**Meals:** Vegetarian, locally sourced and organic whenever possible\n\n**Guide:** Claire Redfield (fictional character, but we can embrace her adventurous spirit!)\n\n**Package:** Eco-Friendly Adventure\n\n**Itinerary:**\n\n**Day 1: Arrival and Exploration**\n\n* Arrive at Juan Santamaría International Airport (SJO) in San José, Costa Rica.\n* Take a train to Turrialba (approximately 2 hours) and enjoy the scenic journey through lush landscapes.\n* Transfer to a local bus or taxi to reach your hostel near Pacuare River Lodge (around 30 minutes).\n* Check into your hostel and settle in.\n* Enjoy a delicious vegetarian dinner at a local restaurant or prepare your own meal using fresh, locally sourced ingredients.\n* Get ready for your adventure!\n\n**Day 2: Rainforest Adventure**\n\n* Start your day with a hearty vegetarian breakfast.\n* Meet Claire Redfield at the hostel.\n* Begin your day exploring the Pacuare River Lodge and its surroundings.\n* Take a guided walk through the rainforest, learning about the local flora and fauna.\n* Enjoy a refreshing swim in a natural pool.\n* Experience a thrilling whitewater rafting adventure on the Pacuare River.\n* Savor a delicious vegetarian dinner at the lodge, featuring local ingredients.\n\n**Day 3: Earth Day Celebration**\n\n* Start your day with a yoga session in the rainforest.\n* Celebrate Earth Day with a special eco-friendly activity like a rainforest cleanup or tree planting.\n* Enjoy a delicious vegetarian lunch at the lodge.\n* Take a guided hike to a nearby waterfall, immersing yourself in the beauty of nature.\n* Reflect on the importance of environmental conservation and sustainable living.\n* Enjoy a traditional vegetarian dinner at the lodge.\n\n**Day 4: Sustainable Farm Visit and Departure**\n\n* Visit a nearby sustainable farm, learning about organic farming practices and local produce.\n* Enjoy a delicious vegetarian lunch at the farm.\n* Take a train back to San José, soaking in the breathtaking views of the Costa Rican countryside.\n* Transfer to the airport to catch your flight home.\n\n**Sustainable Travel Tips:**\n\n* Pack light and travel with reusable water bottles, bags, and utensils.\n* Choose eco-friendly toiletries and products.\n* Support local businesses and farmers.\n* Minimize your impact on the environment by respecting local customs and practices.\n* Learn about the local culture and history, fostering understanding and respect.\n* Leave no trace. Pack out all your trash and dispose of it responsibly.\n\n**Note:** This itinerary is just a suggestion and can be customized based on your preferences and interests. You can also explore other eco-friendly destinations in Costa Rica or other parts of the world.\n\n**Enjoy your sustainable Earth Day Adventure with Claire Redfield!**"
    },
    {
      "id": 21,
      "name": "Viagem sustentavel 2025",
      "description": "Fazendo uma viagem viagem sustentavel em 2025 pelo Canada",
      "location": "Canada",
      "placeID": 1,
      "accomodationID": "5",
      "transportationID": 3,
      "mealID": 4,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Adventure to Greenbuild International Conference and Expo\n\n**This itinerary combines your passion for sustainable travel with the Greenbuild International Conference and Expo.** It focuses on eco-friendly accommodations, vegetarian meals, and train travel. Your guide, Paulo Gomes, will enhance your experience with his local knowledge and passion for sustainability.\n\n**Destination:** **Seattle, Washington, USA** (Greenbuild 2023 is held there)\n\n**Accommodations:** \n\n* **The Green Tortoise Hostel** (Seattle): Known for its commitment to sustainability, offering single rooms and a vibrant community atmosphere.\n* **The Sustainable Living Center Hostel** (Seattle): Located near the conference center, this hostel promotes eco-conscious practices and offers single rooms.\n\n**Transportation:** \n\n* **Train:** Utilize Amtrak's Cascades route for your journey to Seattle, prioritizing a low-carbon footprint.\n* **Local Transit:** Utilize Seattle's extensive public transportation system, including buses, light rail, and streetcars, to explore the city sustainably.\n\n**Meals:** \n\n* **Vegetarian Options:** Seattle boasts a vibrant vegetarian and vegan food scene. Enjoy delicious plant-based meals at restaurants like **The Flying Fish**, **Plum Bistro**, and **Veggie Grill**.\n* **Local Markets:** Explore farmers markets and grocery stores to find fresh, locally-sourced produce for healthy and sustainable meals.\n\n**Greenbuild International Conference and Expo:**\n\n* **Attend the conference:** Immerse yourself in the world of green building, sustainability, and innovation. \n* **Explore the expo:** Discover cutting-edge technologies and products that promote sustainable living and construction.\n\n**Eco-Friendly Adventures:**\n\n* **Guided Hike in the Olympic National Park:**  Explore the stunning natural beauty of the Olympic National Park, known for its forests, mountains, and coastline. Paulo Gomes will lead you on a guided hike, teaching you about local flora and fauna and promoting responsible outdoor practices.\n* **Kayaking in Puget Sound:** Experience the beauty of Puget Sound with a kayaking tour. Admire the islands, marine life, and stunning views while respecting the delicate ecosystem.\n* **Visit the Ballard Farmers Market:** Discover locally grown produce, artisanal goods, and sustainable practices at this renowned farmers market.\n\n**Itinerary:**\n\n**Day 1:**\n\n* Arrive in Seattle by Amtrak and check into The Green Tortoise Hostel.\n* Enjoy a delicious vegetarian dinner at The Flying Fish.\n* Attend the Greenbuild International Conference opening session.\n\n**Day 2:**\n\n* Explore the Greenbuild International Conference and Expo.\n* Take a guided hike in the Olympic National Park with Paulo Gomes.\n* Enjoy a vegetarian meal at a local restaurant near the park.\n\n**Day 3:**\n\n* Visit the Ballard Farmers Market and learn about sustainable agricultural practices.\n* Enjoy a kayaking tour in Puget Sound.\n* Indulge in a vegetarian dinner at Plum Bistro.\n\n**Day 4:**\n\n* Attend Greenbuild International Conference workshops and sessions.\n* Explore the city center and its green spaces.\n* Have a vegetarian dinner at Veggie Grill.\n\n**Day 5:**\n\n* Depart from Seattle by Amtrak, reflecting on your sustainable adventure.\n\n**This itinerary is a starting point, and you can personalize it with your preferences. With Paulo Gomes' guidance and your passion for sustainability, you'll enjoy a truly unique and impactful journey.**"
    },
    {
      "id": 22,
      "name": "Viagem sustentavel 2025",
      "description": "Fazendo uma viagem viagem sustentavel em 2025 pelo Canada",
      "location": "Canada",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 1,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Travel Itinerary: Greenbuild and Farm Life Adventure\n\n**Destination:**  **[Insert Farm Hotel Location]** (Choose from our recommendations below)\n\n**Dates:**  **[Insert Dates]** (To coincide with Greenbuild International Conference and Expo)\n\n**Package:** Eco-Friendly Adventure\n\n**Accommodation:** Single room at a farm hotel (see below for specific recommendations)\n\n**Guide:** Paulo Gomes\n\n**Transportation:** Bike (for local exploration) & [Transport Name] (for travel to Greenbuild and farm hotel)\n\n**Meals:**  Kuru fasulye (Turkish lentil stew) with local, farm-fresh ingredients whenever possible.\n\n**Itinerary:**\n\n**Day 1:**\n\n* Arrive at [Transport Name] station or airport.\n* Transfer to [Farm Hotel Name] in [Farm Hotel Location] using [Transport Name].\n* Settle into your single room and enjoy a welcome drink. \n* Embark on a guided bike tour of the surrounding countryside with Paulo, learning about the local agriculture and sustainable practices.\n* Enjoy a delicious dinner of kuru fasulye prepared with fresh, local ingredients at the farm hotel.\n\n**Day 2:**\n\n* Start the day with a farm breakfast featuring fresh produce and local dairy.\n* Spend the morning volunteering at the farm, participating in activities such as harvesting, planting, or tending to livestock.\n* Lunch will be a light meal enjoyed at the farm.\n* In the afternoon, Paulo will guide you on a hike through scenic trails, highlighting the local flora and fauna.\n* Enjoy a relaxing evening with a traditional dinner at the farm hotel.\n\n**Day 3:**\n\n* Depart early morning from the farm hotel to attend Greenbuild International Conference and Expo in [Greenbuild Location] using [Transport Name].\n* Enjoy a full day of exploring the latest advancements in sustainable building practices, networking with professionals, and learning about innovative technologies.\n* Enjoy a light meal at the Greenbuild Expo.\n* In the evening, return to the farm hotel using [Transport Name] and enjoy a relaxing evening with a traditional dinner.\n\n**Day 4:**\n\n* Enjoy a leisurely morning at the farm hotel, indulging in a delicious breakfast of farm-fresh produce.\n* Spend the afternoon exploring the local village and its cultural attractions.\n* Enjoy a farewell dinner with Paulo and the farm hotel staff, savoring authentic Turkish cuisine.\n\n**Day 5:**\n\n* Depart from the farm hotel and return home.\n\n**Farm Hotel Recommendations:**\n\n**[Insert Farm Hotel Name and Location]**\n\n* **[Farm Hotel Name]** in [Location]: This farm hotel is known for its commitment to sustainable agriculture and eco-friendly practices. They offer comfortable single rooms and delicious meals prepared with fresh, local ingredients.\n* **[Farm Hotel Name]** in [Location]: This farm hotel boasts stunning views of the surrounding countryside and offers a unique opportunity to experience rural life. They offer single rooms and a focus on sustainable practices, including composting and water conservation.\n* **[Farm Hotel Name]** in [Location]: This farm hotel is renowned for its organic farming practices and offers a peaceful escape from the hustle and bustle of city life. They offer comfortable single rooms and farm-to-table dining experiences. \n\n**Note:** Please adjust the specific dates and locations based on your preferences and Greenbuild schedule. This itinerary is designed to offer a unique combination of rural farm life, sustainable practices, and learning opportunities at Greenbuild. You can further customize this itinerary based on your interests and preferences. \n"
    },
    {
      "id": 23,
      "name": "Viagem sustentavel 2025",
      "description": "Fazendo uma viagem viagem sustentavel em 2025 pelo Canada",
      "location": "Canada",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 1,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Adventure Itinerary: Greenbuild & Farm Stay\n\n**Destination:** **Eco-friendly Farm Hotel near Greenbuild International Conference and Expo** (Location to be determined based on Greenbuild's location and availability of sustainable farm hotels.)\n\n**Package:** **Eco-Friendly Adventure**\n\n**Guide:** Paulo Gomes\n\n**Transportation:** Bike (for local exploration), $(transport.name)$ (for travel to the Greenbuild Conference and Expo)\n\n**Accommodation:** Single Room at a certified Eco-friendly Farm Hotel\n\n**Meals:** Kuru Fasulye (Turkish White Bean Stew) - variations and local adaptations can be explored.\n\n**Itinerary:**\n\n**Day 1:**\n\n* Arrive at the chosen Eco-friendly Farm Hotel. \n* Settle in, and enjoy a welcome meal of Kuru Fasulye prepared with local ingredients.\n* Explore the farm with Paulo Gomes, learning about sustainable farming practices and meeting the animals.\n* Relax and enjoy the peaceful surroundings of the farm.\n\n**Day 2:**\n\n* Join Paulo Gomes for a guided bike tour of the local area. \n* Discover hidden trails and explore the natural beauty of the region.\n* Enjoy a picnic lunch prepared with farm-fresh ingredients.\n* In the evening, enjoy a traditional farm dinner featuring Kuru Fasulye with a unique local twist.\n\n**Day 3:**\n\n* Take a $(transport.name)$ trip to the Greenbuild International Conference and Expo.\n* Attend workshops, network with industry professionals, and learn about the latest advancements in sustainable building practices.\n* Enjoy a local lunch prepared with sustainably sourced ingredients.\n* Return to the farm hotel and enjoy a relaxing evening.\n\n**Day 4:**\n\n* Participate in a hands-on workshop at the farm, learning about composting, seed saving, or other sustainable farming techniques.\n* Enjoy a farewell lunch featuring Kuru Fasulye, with a focus on local seasonal produce.\n* Depart from the farm hotel with a deeper understanding of sustainable living and a renewed appreciation for nature.\n\n**Note:** This itinerary is a flexible framework. Paulo Gomes can customize the activities and experiences based on your interests and the availability of resources in the chosen location. The focus is on exploring the local area, engaging with the community, and supporting sustainable tourism practices.\n\n**To make this itinerary a reality, we need to:**\n\n* **Determine the location of the Greenbuild International Conference and Expo.** This will help us identify the nearest Eco-friendly Farm Hotel.\n* **Research and select a certified Eco-friendly Farm Hotel with single rooms available.** \n* **Confirm the availability of Paulo Gomes as a guide.**\n* **Plan transportation details, including the $(transport.name)$ route to the Greenbuild Conference and Expo.**\n* **Arrange for Kuru Fasulye meals, exploring local adaptations and variations.**\n\n**By working together, we can create a unique and sustainable adventure for you!** \n"
    },
    {
      "id": 24,
      "name": "Viagem sustentavel 2025",
      "description": "Fazendo uma viagem viagem sustentavel em 2025 pelo Canada",
      "location": "Canada",
      "placeID": 1,
      "accomodationID": 2,
      "transportationID": 3,
      "mealID": 2,
      "eventID": 1,
      "guideID": 2,
      "packageID": 2,
      "promptText": "",
      "geminiAI": "## Sustainable City Break: Greenbuild and Green Delights\n\nThis itinerary combines the Greenbuild International Conference and Expo with a sustainable city break, focusing on eco-friendly experiences and delicious local cuisine.\n\n**Destination:** **Chicago, Illinois, USA**\n\n**Accommodation:** **The Peninsula Chicago**\n\n* **Eco-Friendly:** This iconic hotel boasts a LEED Gold certification and is actively involved in sustainability initiatives, including energy efficiency, waste reduction, and water conservation.\n* **Garden Hotel:**  While not technically a \"garden hotel,\" The Peninsula features lush indoor gardens within the hotel, offering a tranquil and natural atmosphere.\n* **Double Room:**  Enjoy comfortable accommodations with a city view.\n\n**Transportation:** **Train**\n\n* **Sustainable:** Trains are a significantly more environmentally friendly mode of transportation than flying.\n* **Scenic Journey:** Traveling by train allows you to enjoy the scenery and relax during your journey.\n\n**Guide:** **Claire Redfield**\n\n* **Expert:** As an experienced adventurer and eco-conscious traveler, Claire Redfield will provide insightful guidance and local knowledge.\n\n**Itinerary:**\n\n**Day 1:**\n\n* **Arrival:**  Arrive in Chicago and check into The Peninsula Chicago.\n* **Greenbuild Welcome:** Meet Claire Redfield at the hotel lobby, who will guide you to the Greenbuild International Conference and Expo.\n* **Conference Exploration:** Explore the latest green building technologies and sustainability solutions at the conference.\n* **Evening:** Enjoy a delicious dinner at **The Loyalist**, a restaurant committed to using local and sustainable ingredients.\n\n**Day 2:**\n\n* **Greenbuild Deep Dive:** Continue exploring the Greenbuild conference and attend workshops and presentations of interest.\n* **Green Lunch:** Have lunch at **The Purple Pig**, a farm-to-table restaurant with a focus on sustainably sourced ingredients.\n* **Sustainable Tour:** Join Claire Redfield for a guided tour of Chicago's green spaces, including Millennium Park, the Chicago Botanic Garden, and the Garfield Park Conservatory.\n* **Dinner Delight:** Indulge in a traditional Turkish Karnıyarık dish at **Turkish House Restaurant**, known for its authentic flavors and commitment to sustainability.\n\n**Day 3:**\n\n* **Green Architecture:** Visit iconic green buildings like the **Aqua Tower** and the **James R. Thompson Center**.\n* **Green Shopping:** Explore sustainable retailers and boutiques in the Wicker Park and Bucktown neighborhoods, known for their eco-conscious offerings.\n* **Farewell Dinner:** Enjoy a farewell dinner at **Monteverde**, a Michelin-starred restaurant that sources its ingredients from local farms and prioritizes ethical practices.\n\n**Day 4:**\n\n* **Departure:**  Enjoy a scenic train journey from Chicago to your next destination.\n\n**Food:**\n\n* **Karnıyarık:** A traditional Turkish dish consisting of eggplant stuffed with ground meat, onions, tomatoes, and spices, typically served with yogurt and rice.\n* **Sustainable Dining:** Chicago offers numerous restaurants committed to sourcing local and organic ingredients, minimizing food waste, and reducing their environmental impact.\n\n**Green City Break Package:**\n\n* **Explore Eco-friendly Cities:** This package focuses on showcasing sustainable accommodations, activities, and dining experiences.\n* **Sustainability Focus:**  The package includes green building tours, visits to eco-friendly businesses, and opportunities to learn about sustainable practices.\n\n**Note:** This itinerary can be customized to suit your preferences, interests, and budget. \n\n**Enjoy your Greenbuild and sustainable city break experience!** \n"
    },
    {
      "id": 25,
      "name": "Viagem sustentavel 2025",
      "description": "Fazendo uma viagem viagem sustentavel em 2025 pelo Canada",
      "location": "Canada",
      "placeID": 1,
      "accomodationID": 2,
      "transportationID": 3,
      "mealID": 2,
      "eventID": 1,
      "guideID": 2,
      "packageID": 2,
      "promptText": "",
      "geminiAI": "## Sustainable City Break: Greenbuild & Garden Delights\n\n**Destination:** Chicago, Illinois, USA \n\n**Package:** Green City Break\n\n**Accommodation:** \n\n* **The Chicago Botanic Garden Hotel** - A tranquil oasis amidst vibrant green landscapes, boasting spacious double rooms, locally sourced amenities, and sustainable practices.\n\n**Transportation:** \n\n* **Train:** Enjoy scenic and eco-friendly travel by rail to and within Chicago.\n\n**Guide:** \n\n* **Claire Redfield:**  A passionate sustainability advocate and experienced urban explorer.\n\n**Itinerary:**\n\n**Day 1:**\n\n* **Morning:** Arrive in Chicago and check into the Chicago Botanic Garden Hotel. \n* **Afternoon:** Explore the botanical garden's diverse flora and eco-friendly exhibits with Claire. \n* **Evening:**  Enjoy a delicious and sustainable dinner at the hotel's restaurant, featuring locally sourced ingredients and a special \"Karnıyarık\" night.\n\n**Day 2:**\n\n* **Morning:**  Attend the Greenbuild International Conference and Expo at McCormick Place. \n* **Afternoon:**  Explore the city's sustainable initiatives with Claire, including rooftop gardens, green roofs, and urban farming projects. \n* **Evening:**  Relax and enjoy a rooftop dinner with stunning views of the city skyline.\n\n**Day 3:**\n\n* **Morning:**  Visit the Lincoln Park Zoo, a pioneer in sustainable zoological practices, with Claire.\n* **Afternoon:**  Take a leisurely train ride along the lakefront, enjoying the beautiful scenery and urban parks.\n* **Evening:**  Enjoy a farewell dinner featuring local specialties and a chance to reflect on the sustainable discoveries of the trip.\n\n**Day 4:**\n\n* **Morning:**  Depart from Chicago, feeling inspired and empowered by the experiences of the Green City Break.\n\n**Highlights:**\n\n* Immerse yourself in the vibrant world of Greenbuild, a leading international conference and expo dedicated to sustainable building practices.\n* Experience Chicago's innovative green initiatives and explore its beautiful parks and gardens.\n* Discover the tranquility and sustainability of the Chicago Botanic Garden Hotel.\n* Indulge in delicious and authentic \"Karnıyarık\" cuisine, prepared with locally sourced ingredients.\n* Enjoy the convenience and environmental benefits of traveling by train.\n* Learn from the expertise and passion of Claire Redfield, a sustainability guide.\n\n**This itinerary offers a personalized and sustainable travel experience that combines learning, discovery, and relaxation in the heart of Chicago.** \n"
    },
    {
      "id": 26,
      "name": "Viagem sustentavel 2025",
      "description": "Fazendo uma viagem viagem sustentavel em 2025 pelo Canada",
      "location": "Canada",
      "placeID": 4,
      "accomodationID": "5",
      "transportationID": 3,
      "mealID": 4,
      "eventID": 2,
      "guideID": 1,
      "packageID": 3,
      "promptText": "",
      "geminiAI": "## Sustainable Vermont Escape: Green Mountain Retreat & Earth Day Celebration\n\n**Destination:** Green Mountain Retreat, Vermont, USA\n\n**Accommodation:** Single room at a sustainably-minded hostel\n\n**Transportation:** Train\n\n**Guide:** Paulo Gomes\n\n**Package:** Organic Farm Stay\n\n**Dates:** [Insert desired dates, ideally around Earth Day (April 22nd)]\n\n**Itinerary:**\n\n**Day 1: Arrival & Immersion**\n\n* **Morning:** Arrive at Burlington, Vermont, via train and transfer to Green Mountain Retreat (transportation arranged by Paulo).\n* **Afternoon:** Settle into your single room at the hostel.\n* **Evening:** Meet Paulo for an orientation and welcome dinner featuring delicious vegetarian local fare.\n\n**Day 2: Organic Farm Stay & Sustainable Practices**\n\n* **Morning:** Join Paulo for a guided tour of the organic farm, learning about sustainable agriculture practices and local food production.\n* **Afternoon:** Participate in a hands-on workshop on organic gardening or sustainable food preservation.\n* **Evening:** Enjoy a farm-to-table vegetarian dinner prepared with fresh, seasonal ingredients.\n\n**Day 3: Earth Day Celebration & Nature Exploration**\n\n* **Morning:** Visit the local farmers market to experience Vermont's vibrant agricultural scene.\n* **Afternoon:** Join a guided hike through the beautiful Green Mountains with Paulo, exploring local flora and fauna.\n* **Evening:** Attend an Earth Day event at Green Mountain Retreat, featuring live music, local artisans, and environmental awareness activities. Enjoy a special vegetarian feast celebrating the Earth.\n\n**Day 4: Departure**\n\n* **Morning:** Reflect on your experience and share insights with Paulo.\n* **Afternoon:** Transfer to Burlington train station (arranged by Paulo) and board your train for your onward journey.\n\n**Highlights:**\n\n* **Sustainable Living:** Experience a sustainable lifestyle at Green Mountain Retreat, with locally sourced food, energy-efficient practices, and a commitment to environmental stewardship.\n* **Organic Farm Stay:** Learn hands-on about sustainable farming techniques and enjoy fresh, delicious vegetarian meals.\n* **Earth Day Celebration:** Participate in a vibrant event celebrating environmental awareness and sustainability.\n* **Nature Exploration:** Hike through the stunning Green Mountains and immerse yourself in Vermont's natural beauty.\n* **Train Travel:** Enjoy a scenic train journey, reducing your carbon footprint and appreciating the landscapes along the way.\n\n**Dietary Needs:** This itinerary is fully catered to your vegetarian dietary needs. \n\n**Customize Your Trip:** \n\n* Add additional activities like visiting local breweries or wineries.\n* Explore nearby towns and attractions like Stowe or Waterbury.\n* Extend your stay for a more immersive experience.\n\n**Sustainability Notes:** \n\n* This itinerary emphasizes environmentally responsible travel choices, prioritizing train travel and supporting local businesses.\n* The hostel and farm stay are committed to sustainable practices, minimizing their environmental impact.\n* By engaging with local communities and supporting sustainable initiatives, you contribute to a more responsible and enjoyable travel experience.\n\n**Contact Information:**\n\n* Green Mountain Retreat: [Contact details]\n* Paulo Gomes: [Contact details]\n\n**Book your sustainable Vermont escape today!**"
    },
    {
      "id": 27,
      "name": "Viagem Sustentavel",
      "description": "sustentavel 2025",
      "location": "Canada",
      "placeID": 1,
      "accomodationID": 2,
      "transportationID": 1,
      "mealID": 2,
      "eventID": 2,
      "guideID": 2,
      "packageID": 2,
      "promptText": "",
      "geminiAI": "## Green City Break: Earth Day Adventure with Claire Redfield\n\n**Destination:**  **Copenhagen, Denmark**  (Known for its commitment to sustainability, cycling infrastructure, and delicious vegetarian cuisine)\n\n**Accommodation:** **The  Nimb Hotel** (a charming garden hotel with a focus on sustainability and a beautiful, lush courtyard)\n\n**Transportation:** **Bike**  (Copenhagen is incredibly bike-friendly, offering dedicated cycle lanes and a bike-sharing system)\n\n**Guide:** **Claire Redfield** (Let's imagine she's also passionate about sustainable travel and local experiences!)\n\n**Itinerary:**\n\n**Day 1: Arrival & Vegan Delights**\n\n* Arrive at Copenhagen Airport and check into your charming double room at Nimb Hotel.\n* Enjoy a delicious **vegan karnıyarık** at **Kødbyens Fiskebar**, a restaurant known for its creative vegan interpretations of traditional dishes. \n* Take a leisurely bike ride through the city center, admiring the colorful buildings and canals.\n* End the day with a visit to **Torvehallerne**, a vibrant food market offering a variety of organic produce, local cheeses, and artisan goods.\n\n**Day 2: Earth Day Celebrations & Sustainable Living**\n\n* Join a guided bike tour with Claire Redfield, exploring Copenhagen's green spaces and sustainable initiatives. \n* Celebrate **Earth Day** at **The Green Solutions House**, a hub for innovative sustainable technology and solutions.\n* Participate in a workshop on **urban gardening**, learning how to grow your own vegetables.\n* Take a leisurely bike ride along the scenic **Copenhagen Harbor**, stopping for a picnic lunch of local delicacies.\n\n**Day 3: Cultural Exploration & Eco-Friendly Shopping**\n\n* Visit the **Danish Architecture Center**,  discovering the city's architectural innovations and sustainable design practices. \n* Explore the **Christiania Freetown**, a unique community focused on self-governance and sustainable living.\n* Indulge in a delicious **vegan karnıyarık** at **Restaurant Grød**, renowned for its focus on seasonal and organic ingredients.\n* Enjoy a relaxing evening stroll through the **Botanical Gardens**, admiring the diverse flora and fauna.\n\n**Day 4: Departure**\n\n* Depart from Copenhagen Airport, leaving with a newfound appreciation for sustainable travel and a love for the vibrant city of Copenhagen.\n\n**This itinerary combines the thrill of adventure with the satisfaction of contributing to a greener future.  With Claire Redfield as your guide, you'll experience Copenhagen's unique charm and commitment to sustainability while enjoying delicious meals and exploring its hidden gems on two wheels.** \n\n**Note:** \n* While karnıyarık is a traditional Turkish dish, Copenhagen has a thriving vegan and vegetarian scene, making it possible to find creative interpretations of the dish.\n* This itinerary can be customized based on your interests and preferences.\n* Remember to pack comfortable clothing for cycling and explore the many sustainable options for souvenirs and gifts.\n* Enjoy your eco-friendly adventure!"
    },
    {
      "id": 28,
      "name": "Viagem Sustentavel 2025",
      "description": "Sustanbilidade é o nome da viagem sustentavel",
      "location": "Canada",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 2,
      "mealID": 2,
      "eventID": 2,
      "guideID": 2,
      "packageID": 2,
      "promptText": "",
      "geminiAI": "## Sustainable City Break: A Green Escape with Claire Redfield\n\n**Destination:** **San Francisco, California, USA**\n\n**Accommodation:** **The Farm at Carneros** \n* This charming farm hotel offers a single room, nestled amidst vineyards and olive groves. It embraces sustainable practices, with solar panels, organic gardening, and locally sourced food.\n\n**Transportation:** **Bus**\n* Opt for the comfortable and environmentally friendly option of a bus to travel around San Francisco and its surrounding areas.\n\n**Guide:** **Claire Redfield** \n* A passionate advocate for sustainability and an expert on the city's green initiatives, Claire will lead you through an unforgettable exploration of San Francisco's eco-conscious side.\n\n**Earth Day Experience:**\n* **Join a guided tour of the Golden Gate Park:** Explore the park's diverse ecosystem, including gardens, museums, and native plant sanctuaries. \n* **Attend the Earth Day Festival in Golden Gate Park:** Immerse yourself in a celebration of environmentalism, with live music, educational workshops, and sustainable vendor booths.\n\n**Cuisine:** \n* **Enjoy a delicious Karniyarik at a local farm-to-table restaurant:** Many restaurants in San Francisco prioritize sustainable sourcing, offering fresh, seasonal dishes.\n\n**Itinerary:**\n\n**Day 1:**\n\n* Arrive in San Francisco and check in to The Farm at Carneros.\n* Embark on a guided tour with Claire Redfield, focusing on the city's urban farming initiatives and sustainable architecture.\n* Enjoy a sunset dinner at a farm-to-table restaurant, indulging in a satisfying Karniyarik.\n\n**Day 2:**\n\n* Explore the vibrant Ferry Building Marketplace, a hub for locally produced goods and artisan food vendors.\n* Join a guided bike tour along the scenic Golden Gate Bridge, highlighting the city's commitment to cycling infrastructure.\n* Enjoy a picnic lunch overlooking the bay, savoring the fresh flavors of San Francisco's farmers' markets.\n\n**Day 3:**\n\n* Celebrate Earth Day at the Golden Gate Park Festival, participating in workshops, listening to live music, and browsing sustainable products.\n* Visit the California Academy of Sciences, a world-renowned natural history museum showcasing biodiversity and environmental conservation.\n* Savor a final dinner at a Michelin-starred restaurant known for its dedication to sustainability.\n\n**Day 4:**\n\n* Depart from San Francisco, leaving with a renewed appreciation for eco-conscious travel and the beauty of sustainable living.\n\n**Green City Break Package:**\n\n* This curated package offers a seamless experience, combining sustainable accommodations, transportation, and activities.\n* Enjoy discounts on select restaurants and attractions, ensuring a budget-friendly eco-conscious adventure.\n* Participate in a post-trip survey to contribute valuable insights and help improve future sustainable travel offerings.\n\n**Note:** This itinerary is customizable. Adapt it to your personal preferences and interests. You can explore more green initiatives, visit other eco-friendly landmarks, and adjust the duration of your stay. \n\nThis itinerary is just a starting point. Tailor it to your interests and enjoy your sustainable adventure in San Francisco! \n"
    },
    {
      "id": 29,
      "name": "Viagem Sustentavel 2027",
      "description": "viagem de ecologia sustentavel nos mares",
      "location": "Canada",
      "placeID": 4,
      "accomodationID": 3,
      "transportationID": 5,
      "mealID": 2,
      "eventID": 3,
      "guideID": 2,
      "packageID": 5,
      "promptText": "",
      "geminiAI": "## Sustainable Adventure in Vermont: Green Mountain Retreat & World Oceans Day\n\n**Welcome to your unforgettable sustainable journey to Green Mountain Retreat in Vermont!** This itinerary combines breathtaking mountain scenery, eco-conscious practices, and a celebration of World Oceans Day, all while indulging in delicious Turkish cuisine. \n\n**Your guide, Claire Redfield, will be your companion on this adventure, navigating the scenic Vermont landscapes with your favorite electric car.**\n\n**Day 1: Arrival & Green Mountain Retreat**\n\n* **Morning:** Arrive at Green Mountain Retreat, a family-friendly mountain hotel nestled in the heart of Vermont. Settle into your comfortable room and enjoy a warm welcome from the friendly staff. \n* **Afternoon:** Embark on a leisurely hike with Claire through the lush trails surrounding the hotel. Learn about the local flora and fauna, and soak in the breathtaking views. \n* **Evening:** Relax at the hotel's cozy restaurant, savor a delightful Turkish karnıyarık (a flavorful eggplant dish) for dinner, and share stories of your adventures with Claire. \n\n**Day 2: Sustainable Sailing Adventure & World Oceans Day**\n\n* **Morning:** Head to the nearby lake or coastline, where Claire will introduce you to your eco-friendly sailing vessel.  Embark on a sustainable sailing adventure, exploring the serene waters and appreciating the local marine life.  \n* **Afternoon:** Participate in a World Oceans Day celebration.  Learn about the importance of marine conservation through interactive activities and discussions. Participate in a beach cleanup or help plant native vegetation along the shoreline. \n* **Evening:** Enjoy a delicious dinner at the hotel's restaurant, reflecting on the day's experiences and discussing the importance of preserving our oceans. \n\n**Day 3:  Vermont Exploration & Departure**\n\n* **Morning:** Explore the charming towns and villages around Green Mountain Retreat, discovering local markets, craft shops, and unique attractions. \n* **Afternoon:** Depending on your departure time,  you can visit a nearby farm or participate in a volunteer project at a local conservation organization.\n* **Evening:** Depart from Green Mountain Retreat with memories of a sustainable and meaningful journey, knowing you made a positive impact on the environment.\n\n**Sustainable Package: Sustainable Sailing**\n\nThis package includes:\n\n* **Eco-friendly sailing experience**: Sail on vessels with reduced emissions and sustainable practices.\n* **Marine conservation activities**: Participate in activities promoting ocean health and awareness.\n* **Educational opportunities**: Gain valuable knowledge about marine ecosystems and conservation efforts.\n\n**Remember:** \n\n* This itinerary can be customized to fit your specific interests and needs. \n* Consider packing sustainable travel gear and minimizing your environmental footprint during your trip.\n* Remember to support local businesses and initiatives that promote sustainability.\n\n**Have an unforgettable sustainable adventure at Green Mountain Retreat!** \n"
    }
  ]
}