{
  "itineraries": [
    {
      "id": 1,
      "name": "Beach Vacation",
      "description": "A relaxing vacation at the beach",
      "location": "worldwide",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 1,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": ""
    },
    {
      "id": 20,
      "name": "Beach Vacation",
      "description": "A relaxing vacation at the beach",
      "location": "Hawaii",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 1,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "## Sustainable Travel Itinerary: Greenbuild & Farm Stay Adventure\n\n**Destination:**  **[Choose your preferred location]** - This itinerary can be customized for any location hosting the Greenbuild International Conference & Expo. \n\n**Package:** **Eco-Friendly Adventure**\n\n**Accommodation:** **[Choose your preferred Farm Hotel]** - Look for hotels certified by organizations like Green Key or LEED, offering sustainable practices like organic farming, renewable energy, and waste reduction.\n\n**Transportation:** **Bike** (for local travel) & **[transport.name]** (for long-distance travel) - Ensure your chosen transportation aligns with your sustainability goals. Consider eco-friendly options like electric vehicles, trains, or carpooling.\n\n**Guide:** **Paulo**\n\n**Meals:** **Vegetarian**\n\n**Itinerary:**\n\n**Day 1:**\n\n* **Morning:** Arrive at [Airport/Train Station] and transfer to your chosen Farm Hotel using [transport.name].\n* **Afternoon:** Settle into your single room and enjoy a welcome vegetarian lunch at the hotel restaurant featuring locally sourced ingredients.\n* **Evening:** Attend a welcome dinner at the hotel with other guests. Enjoy the local atmosphere and learn about the farm's sustainable practices.\n\n**Day 2:**\n\n* **Morning:** Start your day with a guided bike tour with Paulo through the local area, exploring farms, markets, and scenic landscapes.\n* **Lunch:** Enjoy a delicious vegetarian lunch at a local farm-to-table restaurant.\n* **Afternoon:** Participate in a hands-on workshop at the farm, learning about sustainable farming techniques like composting, seed saving, or permaculture.\n* **Evening:** Relax and enjoy a vegetarian dinner at the hotel, accompanied by live music or a bonfire.\n\n**Day 3:**\n\n* **Morning:** Head to the Greenbuild International Conference & Expo. Take a [transport.name] to the venue.\n* **Day:** Immerse yourself in the conference, exploring the latest innovations in green building, sustainable design, and environmental technologies.\n* **Evening:** Return to the hotel and enjoy a relaxing evening with a vegetarian dinner at the hotel restaurant.\n\n**Day 4:**\n\n* **Morning:** Participate in a guided bike tour with Paulo, exploring local green initiatives and community gardens. \n* **Lunch:** Have a vegetarian picnic lunch at a scenic spot along the route.\n* **Afternoon:** Return to the hotel and engage in optional activities like yoga, meditation, or a spa treatment. \n* **Evening:** Enjoy a farewell dinner at the hotel, savoring a delicious vegetarian meal and reflecting on your experiences.\n\n**Day 5:**\n\n* **Morning:** Depart from the hotel and head to the airport/train station using [transport.name].\n\n**Throughout your trip:**\n\n* Embrace local customs and traditions. \n* Support local businesses and artisans.\n* Minimize waste by using reusable water bottles, bags, and utensils.\n* Practice responsible tourism by respecting local wildlife and ecosystems.\n\n**This itinerary is customizable:**\n\n* Choose a location that best suits your interests and budget.\n* Adjust the activities to fit your personal preferences.\n* Add more days to explore other nearby attractions.\n* Enhance your experience with additional activities like hiking, kayaking, or birdwatching.\n\n**By choosing this sustainable travel itinerary, you contribute to responsible tourism while enjoying a meaningful and enriching experience.**"
    },
    {
      "id": 2,
      "name": "Beach Vacation",
      "description": "A relaxing vacation at the beach",
      "location": "Hawaii",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 1,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Adventure Itinerary: Greenbuild International Conference and Expo with Paulo\n\n**This itinerary combines the Greenbuild International Conference and Expo with a sustainable farm stay experience, focusing on vegetarian meals, eco-friendly accommodation, and biking exploration.**\n\n**Destination:**  **[Choose a location hosting Greenbuild Conference] ** (e.g., Toronto, Canada)\n\n**Duration:** 7 Days (flexible)\n\n**Accommodation:**\n\n* **Farm Hotel:**  [Choose a Farm Hotel near the conference location, focusing on sustainable practices like organic farming and renewable energy. Example: **The Farm at Tintern, Wales** or **The Farmhouse at Red Roofs, India**] \n* **Room:** Single\n\n**Transportation:**\n\n* **To/from the Conference:**  $(transport.name) \n* **Within the Destination:**  **Bike**\n\n**Guide:**\n\n* **Paulo:** [If Paulo is a local guide with knowledge of sustainable tourism, include his contact info. Otherwise, find a local guide specializing in eco-tours and biking.]\n\n**Meals:**\n\n* All meals will be vegetarian and sourced locally from the farm whenever possible. \n\n**Day 1:**\n\n* Arrive at the Farm Hotel and settle in.\n* Enjoy a welcome vegetarian dinner at the farm restaurant, featuring fresh, locally sourced ingredients.\n* Discuss your itinerary and explore sustainable activities with Paulo.\n\n**Day 2:**\n\n* **Greenbuild International Conference and Expo:** Attend the conference and network with fellow sustainability professionals.\n* Enjoy a vegetarian lunch at the conference venue.\n* After the conference, bike through the city, exploring its green spaces and sustainable initiatives.\n* Return to the farm for a relaxing evening and a delicious vegetarian dinner.\n\n**Day 3:**\n\n* **Farm Experience:** Participate in farm activities like gardening, harvesting, or animal care.\n* Enjoy a vegetarian lunch made with farm-fresh produce.\n* Explore the surrounding area on your bike, taking in the local scenery.\n* Return to the farm for a relaxing evening with a delicious vegetarian dinner.\n\n**Day 4:**\n\n* **Sustainable Tourism:**  Paulo will guide you on a scenic bike ride to explore local sustainable projects like community gardens, eco-friendly businesses, or nature reserves.\n* Enjoy a packed vegetarian lunch while on your bike tour.\n* Relax at the farm and enjoy a vegetarian dinner with freshly picked ingredients.\n\n**Day 5:**\n\n* **Free Time:** Choose your own adventure! Explore local markets, visit art galleries, or simply relax and enjoy the farm atmosphere.\n* Enjoy a vegetarian lunch at the farm.\n* Enjoy a peaceful evening on the farm, taking in the scenic surroundings.\n\n**Day 6:**\n\n* **Local Market Tour:**  Paulo will lead you on a bike tour to local farmers' markets, where you can sample local products and learn about sustainable agriculture.\n* Enjoy a vegetarian lunch at the farm.\n* Attend a farm-to-table cooking demonstration, learning how to prepare delicious vegetarian dishes using fresh, local ingredients.\n\n**Day 7:**\n\n* Depart from the Farm Hotel.\n\n**Additional Information:**\n\n* **Eco-Friendly Adventure Package:** Include sustainable practices like:\n    * Using local and organic produce for meals.\n    * Minimizing waste through composting and recycling.\n    * Promoting energy efficiency and using renewable energy sources.\n    * Using biodegradable cleaning products and toiletries.\n* **Bike Rental:** Ensure that bikes are provided by the farm or are available for rent locally.\n\n**Optional Activities:**\n\n* **Volunteer at a local environmental organization.**\n* **Take a workshop on sustainable living.**\n* **Attend a local cultural event or festival.**\n\n**This itinerary is a starting point and can be customized to fit your interests and preferences.  You can add or remove days, activities, and destinations based on your needs.** \n"
    },
    {
      "id": 3,
      "name": "Beach Vacation",
      "description": "A relaxing vacation at the beach",
      "location": "Hawaii",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 1,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Adventure at Greenbuild: A Personalized Itinerary\n\n**Destination:**  **Greenbuild International Conference and Expo, Las Vegas, USA** \n\n**Accommodation:** **The Farm at Tule Springs, Nevada** (eco-friendly farm hotel with single occupancy rooms)\n\n**Transportation:** **Bike (personal) for local exploration + $(transport.name) for travel to/from Las Vegas**\n\n**Guide:** **Paulo**\n\n**Package:** **Eco-Friendly Adventure**\n\n**Dietary:** **Vegetarian**\n\n**Itinerary:**\n\n**Day 1:**\n\n* Arrive at Las Vegas McCarran International Airport (LAS) and take $(transport.name) to The Farm at Tule Springs. \n* Settle in and enjoy a welcome vegetarian dinner at the farm's restaurant.\n* Enjoy a guided bike tour with Paulo around the farm, learning about their sustainable practices and local agriculture.\n\n**Day 2:**\n\n* Start your day with a healthy vegetarian breakfast at the farm.\n* Cycle to Greenbuild International Conference and Expo, immersing yourself in the world of sustainable building and design. \n* Attend workshops, presentations, and networking events related to your interests.\n* Enjoy a vegetarian lunch at the Greenbuild Expo.\n* Return to The Farm for a relaxing evening.\n\n**Day 3:**\n\n* Breakfast at the farm followed by a leisurely morning exploring the nearby Red Rock Canyon National Conservation Area on your bike.\n* Enjoy a picnic lunch with vegetarian snacks while taking in the breathtaking desert landscapes.\n* Return to the farm for a late afternoon of relaxation and a delicious vegetarian dinner.\n\n**Day 4:**\n\n* Start the day with a morning yoga session on the farm, surrounded by nature. \n* After breakfast, enjoy a guided farm tour with Paulo, learning about their regenerative farming techniques and sustainable practices.\n* Participate in a hands-on workshop, such as composting or seed starting.\n* Enjoy a delicious vegetarian lunch prepared with fresh farm produce.\n* Relax and enjoy the afternoon at the farm, perhaps reading a book or exploring the grounds.\n\n**Day 5:**\n\n* Enjoy a final vegetarian breakfast at the farm.\n* Pack your belongings and check out of the farm.\n* Take $(transport.name) to McCarran International Airport (LAS) for your departure.\n\n**This itinerary can be customized to your specific interests and needs, including:**\n\n* Adding additional days for further exploration of the Las Vegas area.\n* Visiting other sustainable attractions like the Springs Preserve or the Ethel M Chocolate Factory & Botanical Cactus Garden.\n* Incorporating additional activities like hiking, rock climbing, or birdwatching.\n* Adjusting the transportation based on your preferences and accessibility needs.\n\n**This eco-friendly adventure package will provide you with an enriching experience while supporting sustainable practices. You'll enjoy the comforts of the farm hotel, the freedom of exploring on your bike, and the guidance of Paulo to ensure a meaningful and unforgettable trip.**"
    },
    {
      "id": 4,
      "name": "Beach Vacation",
      "description": "A relaxing vacation at the beach",
      "location": "Hawaii",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 1,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Greenbuild Adventure: A Farm Stay with Paulo\n\n**Destination:** **Greenbuild International Conference and Expo, Las Vegas, USA**\n\n**Dates:** [Insert Dates of Greenbuild Conference]\n\n**Accommodation:** **The Farm at Tule Springs**, a certified sustainable farm hotel offering single rooms, located near Las Vegas, Nevada. \n\n**Transportation:**  **Bike** (personal bike or rental) for exploring the farm and local areas. **Public Transportation** (bus or rideshare) for getting to and from the Greenbuild conference center.\n\n**Guide:** **Paulo** (you can find local guides specializing in sustainable travel or contact Greenbuild for recommendations).\n\n**Package:** **Eco-Friendly Adventure**\n\n**Itinerary:**\n\n**Day 1: Arrival and Farm Immersion**\n\n* Arrive at McCarran International Airport (LAS) and take public transportation to The Farm at Tule Springs. \n* Check-in and settle into your single room. \n* Meet Paulo, your guide, for a welcome orientation and introduction to the farm's sustainable practices.\n* Enjoy a delicious vegetarian dinner made with fresh, locally-sourced ingredients.\n* Participate in an evening farm activity like a guided nature walk or a stargazing session.\n\n**Day 2: Greenbuild Conference**\n\n* Start your day with a healthy vegetarian breakfast prepared using farm-fresh produce.\n* Take public transportation to the Greenbuild International Conference and Expo.\n* Participate in a variety of engaging workshops, presentations, and networking opportunities throughout the day. \n* Enjoy a vegetarian lunch from the conference's food vendors. \n* After the conference, explore the Las Vegas Strip with Paulo, focusing on green initiatives and sustainable attractions. \n* Return to the farm by public transportation and enjoy a relaxing evening.\n\n**Day 3: Exploring the Farm and Local Sustainability**\n\n* After breakfast, take a guided bike tour of the farm with Paulo, learning about its sustainable farming practices and local conservation efforts.\n* Participate in a farm-to-table cooking class using freshly harvested vegetables.\n* Enjoy a delicious vegetarian lunch prepared from your cooking class experience.\n* In the afternoon, explore the nearby Red Rock Canyon National Conservation Area, focusing on the area's unique desert ecosystems and sustainable tourism efforts.\n* Return to the farm for a relaxing evening.\n\n**Day 4: Departure**\n\n* Enjoy a final vegetarian breakfast with the farm community.\n* Take public transportation to McCarran International Airport (LAS) for your departure.\n\n**Sustainable Practices:**\n\n* Staying at a sustainable farm hotel reduces your carbon footprint and supports local communities.\n* Using bikes and public transportation minimizes your reliance on cars and reduces emissions.\n* Eating vegetarian meals promotes animal welfare and reduces your environmental impact.\n* The Greenbuild Conference focuses on sustainable building practices and innovative solutions for environmental challenges.\n* Exploring local natural areas promotes appreciation for biodiversity and conservation efforts.\n\n**Notes:**\n\n* This itinerary is flexible and can be customized based on your interests and preferences.\n* You can find more information about the Greenbuild Conference and sustainable tourism in Las Vegas online.\n* Paulo can assist with finding local bike rentals and public transportation options.\n* Enjoy the experience of a truly sustainable travel adventure, immersing yourself in the natural beauty of the desert and contributing to a greener future. \n"
    },
    {
      "id": 5,
      "name": "Beach Vacation",
      "description": "A relaxing vacation at the beach",
      "location": "Hawaii",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 1,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Travel Itinerary: Greenbuild & Eco-Adventure\n\n**Destination:** **Greenbuild International Conference and Expo** (Location varies annually - you'll need to confirm the 2024 location)\n\n**Travel Style:** Eco-Friendly Adventure, Solo Traveler\n\n**Guide:** Paulo\n\n**Transportation:** Bike (personal or rental)\n\n**Accommodation:**  Farm Hotel (Single Room)\n\n**Meals:** Vegetarian\n\n**Package:** Eco-Friendly Adventure\n\n**Itinerary:**\n\n**Day 1:**\n\n* **Morning:** Arrival at the Greenbuild International Conference and Expo location. \n* **Afternoon:** Check-in at your chosen Farm Hotel. Explore the local farm and learn about their sustainable practices.\n* **Evening:** Enjoy a delicious vegetarian dinner prepared with fresh, locally sourced ingredients at the hotel.\n\n**Day 2:**\n\n* **Morning:** Attend Greenbuild International Conference and Expo sessions.\n* **Afternoon:** Guided bike tour with Paulo. Explore nearby eco-friendly attractions, such as organic farms, wildlife sanctuaries, or community gardens. \n* **Evening:**  Enjoy a vegetarian dinner at a local restaurant with a focus on sustainability.\n\n**Day 3:**\n\n* **Morning:** Attend Greenbuild International Conference and Expo workshops.\n* **Afternoon:** Free time to explore the local area or participate in a sustainable activity organized by the hotel (e.g., composting workshop, seed-saving activity).\n* **Evening:** Relax at the farm hotel and enjoy a final vegetarian dinner.\n\n**Day 4:**\n\n* **Morning:** Farewell breakfast at the Farm Hotel.\n* **Afternoon:** Depart from the Greenbuild International Conference and Expo location.\n\n**Accommodation:**\n\n* **Farm Hotel:** Choose from a variety of eco-friendly farm hotels worldwide. Some options include: \n    * **The Farm at Tremont, Virginia, USA:**  Offers single rooms and farm-to-table vegetarian meals.\n    * **Agriturismo Le Querce, Tuscany, Italy:**  Features a sustainable farm, single room options, and local cuisine. \n    * **The Green Farm, Oxfordshire, UK:**  Provides eco-friendly accommodations and organic meals. \n\n**Transportation:**\n\n* **Bike:**  Bring your own bike or rent a bike locally.  \n* **Public transportation:**  Consider utilizing public transportation to reach the Greenbuild International Conference and Expo location.\n\n**Tips for Sustainable Travel:**\n\n* **Pack light:**  Avoid unnecessary luggage to reduce your carbon footprint.\n* **Choose reusable water bottles and utensils:**  Reduce single-use plastic consumption.\n* **Minimize your impact:**  Be mindful of energy consumption and waste disposal. \n* **Support local businesses:**  Choose restaurants and shops that promote sustainable practices.\n* **Engage with the local community:**  Learn about local environmental initiatives and contribute to their efforts.\n\n**Note:** This itinerary is a suggestion and can be customized based on your interests and time constraints.  \n\nThis itinerary ensures you experience the best of Greenbuild while embracing sustainable practices. The combination of eco-friendly accommodation, vegetarian meals, and biking will minimize your environmental impact, while Paulo's guidance will help you discover local gems and learn about sustainability efforts in the area."
    },
    {
      "id": 6,
      "name": "Beach Vacation",
      "description": "A relaxing vacation at the beach",
      "location": "Hawaii",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 1,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Adventure to Greenbuild: A Farm-to-Table Experience\n\n**Destination:** **Greenbuild International Conference and Expo (Location TBD)**\n\n**Accommodation:** **Eco-Friendly Farm Hotels:**\n\n* **The Farm at Tassajara (California, USA):** A Zen Buddhist monastery offering simple, serene farm stays with vegetarian meals. \n* **The Little Farm (New Zealand):** An off-grid farmstay in the heart of New Zealand's wine country, with a focus on organic farming and sustainable living.\n* **The Green Farm (Italy):** A charming farm hotel nestled in the Tuscan countryside, offering farm-to-table cuisine and opportunities to participate in sustainable farming practices.\n* **Eco-Farmstay (Germany):** A family-run farm in the Black Forest, offering comfortable single rooms and a focus on organic farming and animal welfare. \n* **The Organic Farm (India):** An eco-friendly farm stay in the foothills of the Himalayas, promoting sustainable farming and traditional Indian hospitality.\n\n**Transportation:** **(transport.name) - Specify your preferred sustainable transport option.**\n\n* **Electric Bike:** For exploring local areas and getting to nearby attractions.\n* **Public Transportation:** Utilize local buses and trains for longer journeys.\n* **Train:** Consider a scenic train journey to your chosen destination.\n\n**Package:** **Eco-Friendly Adventure:**\n\n* **Guided Tours by Paulo:** Explore local markets, organic farms, and sustainable initiatives with a knowledgeable guide.\n* **Vegetarian Meals:** Enjoy delicious farm-to-table vegetarian meals, highlighting local and seasonal ingredients.\n* **Outdoor Adventures:**  Engage in eco-friendly activities like hiking, cycling, and kayaking, minimizing your environmental impact. \n* **Volunteer Opportunities:** Participate in sustainable farming practices or contribute to local environmental projects.\n* **Greenbuild International Conference and Expo:** Attend Greenbuild to gain insights into sustainable building practices and network with industry professionals.\n\n**Itinerary Example (Greenbuild in Chicago, USA):**\n\n**Day 1:**\n* Arrive at San Francisco Airport and transfer to The Farm at Tassajara (electric bike or public transportation).\n* Settle in and enjoy a vegetarian dinner prepared with fresh farm produce.\n* Participate in a guided meditation session.\n\n**Day 2:**\n* Explore the farm with Paulo, learning about organic farming practices and meeting the animals.\n* Enjoy a vegetarian lunch in the communal dining hall.\n* Participate in a volunteer activity, such as harvesting vegetables or helping with animal care.\n* Relax in the serene surroundings and enjoy a sunset yoga session.\n\n**Day 3:**\n* Take an electric bike tour through the scenic Tassajara Valley, visiting local farmers markets and enjoying the natural beauty.\n* Enjoy a delicious vegetarian picnic lunch prepared with fresh ingredients from the farm.\n* Head back to the farm and participate in a cooking class, learning to prepare traditional vegetarian dishes.\n* End the day with a peaceful evening meditation session.\n\n**Day 4:**\n* Depart from The Farm at Tassajara and transfer to San Francisco International Airport.\n* Fly to Chicago and check into your hotel (Sustainable Hotel options available in Chicago).\n* Explore downtown Chicago using public transportation and visit Millennium Park, a beautiful green space in the heart of the city.\n* Enjoy a vegetarian dinner at a local restaurant.\n\n**Day 5 - Day 7:**\n* Attend Greenbuild International Conference and Expo, engage in workshops and networking sessions.\n* Explore Chicago's sustainable initiatives, visiting green buildings and eco-friendly businesses.\n* Enjoy vegetarian meals at sustainable restaurants and explore the diverse culinary scene in Chicago.\n\n**Day 8:**\n* Depart from Chicago and return home.\n\n**Note:** This is a sample itinerary, and you can customize it based on your preferences and the location of Greenbuild. \n\n**Remember to research and choose eco-friendly farm hotels that align with your values and preferences. Also, ensure you have all the necessary permits and documentation for traveling with your electric bike.** \n\nHave a sustainable and fulfilling adventure! \n"
    },
    {
      "id": 7,
      "name": "Camping Vacation",
      "description": "A relaxing vacation at the camping ",
      "location": "London",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 1,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Travel Itinerary: Greenbuild & Farmstay Adventure\n\n**Destination:** **Greenbuild International Conference and Expo** in **Las Vegas, Nevada**, followed by a farmstay adventure in **Ojai, California**\n\n**Duration:** 10 days\n\n**Package:** Eco-Friendly Adventure\n\n**Accommodation:**\n\n* **Las Vegas:** **The Green Valley Ranch Resort** -  A LEED certified hotel offering a sustainable experience.\n* **Ojai:** **The Ojai Valley Inn & Spa** - A luxurious farm-to-table resort with a strong commitment to sustainability.\n\n**Transportation:**\n\n* **Las Vegas:**  **(transport.name)** - Sustainable transportation option in Las Vegas (e.g., electric car rental, public transportation, or rideshare services).\n* **Ojai:** **Bike** - Guided bike tours with your guide, Paulo, will allow you to explore the beautiful Ojai Valley.\n\n**Meals:**\n\n* **All meals will be vegetarian** focusing on locally sourced and organic ingredients. Farm-to-table dining will be a highlight of the Ojai experience. \n\n**Itinerary:**\n\n**Day 1:** \n\n* Arrival in Las Vegas and check into The Green Valley Ranch Resort.\n* Explore the resort's sustainable features and enjoy a vegetarian dinner at one of the resort's restaurants.\n\n**Day 2-3:**\n\n* **Greenbuild International Conference and Expo:**  Attend workshops, seminars, and exhibits focusing on sustainable building and design. \n* Network with industry professionals and learn about the latest advancements in green technology.\n* Enjoy vegetarian meals at the conference venue.\n\n**Day 4:**\n\n* **Transfer to Ojai:** Take a scenic drive or a sustainable transportation option to Ojai, California.\n* Check into The Ojai Valley Inn & Spa. \n* Enjoy a welcome vegetarian dinner featuring local produce.\n\n**Day 5-7:**\n\n* **Farmstay Adventure:**\n    * **Guided Bike Tours with Paulo:** Explore the Ojai Valley on your bike, visiting local farms, wineries, and scenic trails.\n    * **Sustainable Farm Activities:** Participate in hands-on farm activities like harvesting, planting, and tending to animals.\n    * **Farm-to-Table Dining:** Enjoy gourmet vegetarian meals prepared with fresh, locally sourced ingredients. \n    * **Relaxation and Wellness:**  Experience the resort's spa and enjoy treatments using natural ingredients. \n    * **Yoga and Mindfulness:**  Attend yoga sessions in the serene Ojai setting.\n\n**Day 8:**\n\n* **Free Day:**  Explore the town of Ojai at your leisure, visit the Ojai Art Center, or relax at the resort.\n* Enjoy a farewell vegetarian dinner at one of the resort's restaurants.\n\n**Day 9:**\n\n* **Departure:**  Transfer back to Las Vegas or your next destination.\n\n**Greenbuild & Farmstay Adventure Highlights:**\n\n* **Sustainable Living Experience:** Immerse yourself in a sustainable lifestyle through eco-friendly accommodations, transportation, and farm-to-table dining.\n* **Greenbuild Expertise:** Gain valuable insights and connections from the leading international conference on sustainable building and design.\n* **Outdoor Adventure:** Enjoy scenic bike rides through the Ojai Valley, exploring its natural beauty and local farms.\n* **Farm-to-Table Cuisine:**  Savor delicious vegetarian meals prepared with fresh, organic ingredients, highlighting the bounty of Ojai's agricultural landscape.\n* **Relaxation and Wellness:**  Rejuvenate your mind and body with spa treatments and mindfulness activities in a serene setting.\n\n**Notes:**\n\n* This itinerary can be customized to suit your interests and preferences.\n* The availability of transportation options and farm activities may vary depending on the time of year.\n* Book your Greenbuild registration and accommodations well in advance.\n* Contact The Ojai Valley Inn & Spa directly for farmstay program details and availability. \n* Inquire about the possibility of electric bike rentals for the guided tours with Paulo. \n\n**This itinerary offers a unique blend of sustainable living, educational opportunities, and outdoor adventures, creating a memorable and eco-conscious travel experience.** \n"
    },
    {
      "id": 8,
      "name": "Road Trip Vacation",
      "description": "A relaxing vacation",
      "location": "London",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 1,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Travel Itinerary: Greenbuild & Farmstay Adventure\n\n**Destination:** Tuscany, Italy\n\n**Accommodation:**  **Agriturismo Il Casale** (Farm Hotel) - Single room\n\n**Transportation:**  **(transport.name)** for arrival and departure, Bike for local travel\n\n**Meals:** Vegetarian, farm-to-table cuisine\n\n**Guide:** Paulo\n\n**Package:** Eco-Friendly Adventure\n\n**Itinerary:**\n\n**Day 1:**\n\n* **Morning:** Arrive at Florence Airport and transfer to **Agriturismo Il Casale**, a charming farm hotel nestled in the rolling hills of Tuscany.\n* **Afternoon:** Meet with Paulo, your guide, for a welcome bike tour of the surrounding countryside, exploring vineyards, olive groves, and charming villages. \n* **Evening:**  Enjoy a delicious vegetarian dinner featuring fresh, locally sourced ingredients at the farm.\n\n**Day 2:**\n\n* **Morning:**  Attend the **Greenbuild International Conference and Expo** in Florence.  Gain insights into sustainable building practices and connect with industry professionals.\n* **Afternoon:**  Guided bike tour through the heart of Florence, visiting iconic landmarks like the Ponte Vecchio and the Duomo, all while learning about the city's rich history and eco-friendly initiatives. \n* **Evening:**  Savor a traditional Tuscan vegetarian meal at a local trattoria.\n\n**Day 3:**\n\n* **Morning:**  Explore the nearby town of Siena, known for its beautiful Piazza del Campo and its annual Palio horse race.  Discover local artisan shops and explore the historical center.\n* **Afternoon:**  Return to the farm and enjoy a leisurely afternoon in the farm's gardens, learning about sustainable farming practices from the owner.\n* **Evening:**  A relaxing evening with a farm-to-table dinner, followed by stargazing in the Tuscan night sky.\n\n**Day 4:**\n\n* **Morning:**  Depart from Agriturismo Il Casale and transfer to Florence Airport for your onward journey.\n\n**Sustainability Features:**\n\n* **Eco-friendly Accommodation:**  Agriturismo Il Casale utilizes solar energy, compost toilets, and promotes sustainable farming practices.  Single room accommodations minimize your ecological footprint.\n* **Vegetarian Meals:**  Experience delicious vegetarian cuisine using fresh, local produce sourced from the farm or surrounding region.\n* **Bike Transportation:**  Reduce your carbon emissions and explore the beautiful Tuscan countryside on two wheels.\n* **Greenbuild International Conference and Expo:** Immerse yourself in the world of sustainable building and design, gaining valuable knowledge and networking with industry experts.\n* **Local Experiences:**  Engage with local culture, traditions, and communities, supporting sustainable tourism.\n\n**Package Details:**\n\nThe **Eco-Friendly Adventure** package includes:\n\n* Accommodation in a single room at Agriturismo Il Casale\n* Daily vegetarian breakfast, lunch, and dinner\n* Bike rental for the duration of your stay\n* Guided bike tours with Paulo\n* Entrance fees to Greenbuild International Conference and Expo\n* Transfer from Florence Airport to Agriturismo Il Casale and back\n\nThis itinerary offers a unique opportunity to experience the beauty of Tuscany while embracing sustainability. You will enjoy delicious vegetarian cuisine, explore the region by bike, and learn about sustainable practices at the farm and during the Greenbuild conference. By choosing this itinerary, you contribute to responsible travel and create lasting memories in a beautiful and environmentally conscious setting. \n"
    },
    {
      "name": "Road Trip Vacation",
      "description": "A relaxing vacation",
      "location": "London",
      "placeID": 1,
      "accomodationID": 1,
      "transportationID": 1,
      "mealID": 1,
      "eventID": 1,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Sustainable Travel Itinerary: Greenbuild and Eco-Adventure \n\n**Destination:**  **Italy** - **Tenuta di Anguillara**, a certified organic farm hotel nestled in the rolling hills near Rome.\n\n**Package:**  **Eco-Friendly Adventure** \n\n**Accommodation:** **Single Room** at Tenuta di Anguillara.\n\n**Transportation:** **Bike** (for local exploration) and **Train** (for travel to Greenbuild International Conference and Expo).\n\n**Guide:**  **Paulo** (will provide local insights and guidance)\n\n**Meals:** **Vegetarian**\n\n**Itinerary:**\n\n**Day 1:**\n\n* **Arrival in Rome:** Take a train from the airport to the charming town of Anguillara Sabazia, where you'll be greeted by Paulo.\n* **Check-in at Tenuta di Anguillara:**  Enjoy the welcoming ambiance of this eco-friendly farm hotel. Settle into your comfortable single room, surrounded by nature.\n* **Welcome Dinner:** Indulge in a delicious vegetarian dinner prepared with fresh, locally sourced ingredients from the farm.\n\n**Day 2:**\n\n* **Morning Exploration:**  Set off on a scenic bike ride through the countryside, exploring charming villages and enjoying breathtaking views. Paulo will guide you along the way, sharing local knowledge and stories. \n* **Farm Experience:**  Join a hands-on workshop at the farm, learning about sustainable farming practices and sampling the fruits of their labor.\n* **Relaxing Evening:**  Enjoy a leisurely dinner at the hotel, savoring the flavors of the local cuisine.\n\n**Day 3:**\n\n* **Greenbuild International Conference and Expo:**  Take a scenic train ride to Milan, where you'll attend Greenbuild, a global gathering of sustainability professionals. \n* **Expo Exploration:** Immerse yourself in the latest sustainable building technologies, innovations, and trends.\n* **Evening Stroll:** Enjoy a relaxing evening walk through Milan, discovering the city's vibrant atmosphere and culinary delights.\n\n**Day 4:**\n\n* **Greenbuild Conference:**  Continue your participation in Greenbuild, attending workshops and networking with industry leaders.\n* **Sustainable City Tour:**  Join a guided tour of Milan, focusing on its eco-friendly initiatives and sustainable urban development.\n* **Farewell Dinner:**  Enjoy a delicious vegetarian meal at a local restaurant, reflecting on the insights gained during your journey.\n\n**Day 5:**\n\n* **Departure:**  Take a train back to Rome and connect to your flight home, leaving with a renewed appreciation for sustainable living and travel.\n\n**Additional Information:**\n\n* This itinerary can be adapted based on your specific interests and time constraints.\n*  Tenuta di Anguillara offers a range of activities, including cooking classes, yoga sessions, and wine tastings.\n*  Paulo will be your knowledgeable guide, providing insights into local culture, history, and sustainable practices.\n*  Bike rentals are available at the hotel for exploring the surrounding countryside.\n\n**This eco-friendly adventure will allow you to experience the beauty of Italy while contributing to sustainable tourism and learning about innovative practices for a greener future.**\n"
    },
    {
      "name": "Viagem para Inglaterra Sustentavel",
      "description": "Viagem sustentavel pela Inglaterra ",
      "location": "Inglaterr",
      "placeID": 2,
      "accomodationID": 3,
      "transportationID": 2,
      "mealID": 4,
      "eventID": 2,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Eco-Friendly Adventure in the Canadian Rockies: An Earth Day Celebration with Paulo\n\n**Destination:** Banff National Park, Canada\n\n**Accommodation:** Lake Louise Inn, a family-friendly mountain hotel nestled in the heart of the Canadian Rockies.\n\n**Transportation:**  Bus (your favorite!)\n\n**Guide:**  Paulo (your experienced and knowledgeable guide)\n\n**Package:** Eco-Friendly Adventure\n\n**Dates:**  April 15th - April 22nd (Earth Day)\n\n**Itinerary:**\n\n**Day 1: Arrival & Settle in:**\n* Arrive at Calgary International Airport (YYC) and meet Paulo. \n* Board the bus for a scenic journey to Lake Louise Inn, where you'll check into your cozy room. \n* After settling in, enjoy a delicious vegetarian dinner at the inn's restaurant, featuring local and seasonal ingredients.\n* Relax and soak in the breathtaking views of the surrounding mountains.\n\n**Day 2: Hike & Explore:**\n* Begin the day with a guided hike to Lake Agnes Tea House, enjoying stunning views of the turquoise waters and surrounding peaks.\n* Enjoy a vegetarian lunch at the tea house, followed by a relaxing stroll back to the inn. \n* In the afternoon, learn about sustainable practices and ecological initiatives within Banff National Park with Paulo.\n\n**Day 3:  Earth Day Celebration:**\n* Celebrate Earth Day with a guided hike to Moraine Lake, known for its breathtaking turquoise beauty and iconic \"Twenty Dollar View.\" \n* Participate in a guided nature walk, focusing on the unique flora and fauna of the park. \n* Learn about the impact of climate change on the Canadian Rockies and discuss solutions for sustainable tourism with Paulo.\n* Enjoy a delicious vegetarian dinner at the inn, reflecting on the importance of environmental stewardship.\n\n**Day 4:  Adventure & Relaxation:**\n* Head out for a day of adventure! Choose from a variety of activities, including:\n    *  Canoeing or kayaking on Lake Louise. \n    *  Exploring the scenic trails around the inn on foot or by bike.\n    *  A visit to the Banff Springs Hotel for a guided tour of its historical architecture.\n* Enjoy a vegetarian picnic lunch amidst the stunning mountain scenery.\n* Relax at the inn's spa or indulge in a traditional Canadian evening with a campfire and stargazing.\n\n**Day 5:  Wildlife Safari & Cultural Immersion:**\n* Embark on a guided wildlife safari, searching for iconic Canadian wildlife like elk, deer, and bears. \n* Learn about the importance of wildlife conservation and the efforts to protect the park's diverse ecosystem.\n* After the safari, visit the Banff National Park Museum for a glimpse into the history and cultural significance of the region.\n* Enjoy a delicious vegetarian dinner featuring local specialties.\n\n**Day 6:  Scenic Drive & Farewell:**\n* Take a scenic drive along the Icefields Parkway, marveling at the breathtaking views of glaciers, waterfalls, and mountain vistas.\n* Stop at the Columbia Icefield for a unique experience on the Athabasca Glacier.\n* Enjoy a final vegetarian lunch before departing for Calgary International Airport (YYC) with fond memories of your eco-friendly adventure in the Canadian Rockies.\n\n**Sustainable Practices:**\n* **Accommodation:** Lake Louise Inn is committed to sustainable practices, including energy efficiency, waste reduction, and water conservation.\n* **Transportation:** The bus is a relatively low-emission mode of transportation, and Paulo will encourage sustainable travel practices throughout the trip.\n* **Meals:** All meals will be vegetarian, featuring fresh, locally sourced ingredients whenever possible, minimizing food miles and supporting local farmers.\n* **Experiences:** The itinerary emphasizes outdoor activities like hiking, canoeing, and wildlife viewing, promoting a connection with nature and encouraging responsible eco-tourism.\n\n**Paulo's Expertise:** \nPaulo will be your knowledgeable guide throughout the journey, sharing insights into the natural beauty, cultural significance, and sustainable practices of Banff National Park. He'll ensure you have a truly memorable and environmentally responsible experience.\n\n**This itinerary is just a suggestion, and it can be customized to your specific interests and preferences. Talk to Paulo about your vision for an unforgettable Earth Day adventure in the Canadian Rockies!**\n"
    },
    {
      "id": "50",
      "name": "Viagem para o Canada",
      "description": "Viagem sustentavel pelo Canada e seus territórios",
      "location": "Canad",
      "placeID": 2,
      "accomodationID": 3,
      "transportationID": 2,
      "mealID": 4,
      "eventID": 2,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Eco-Friendly Adventure: A National Park Escape with Paulo\n\n**Destination:** **Yellowstone National Park, Wyoming, USA**\n\n**Duration:** 7 Days\n\n**Travel Dates:** April 18th - April 24th (Earth Day is April 22nd!)\n\n**Accommodation:** **Old Faithful Inn** (a historic and family-friendly mountain hotel within the park)\n\n**Transportation:** **Bus**\n\n**Guide:** **Paulo**\n\n**Package:** **Eco-Friendly Adventure**\n\n**Itinerary:**\n\n**Day 1:** \n\n* **Arrival in Yellowstone:** Meet Paulo at the park entrance and board the bus for a scenic drive to Old Faithful Inn. Settle in and enjoy a delicious vegetarian dinner at the hotel restaurant.\n* **Evening Exploration:** Take a guided walk around the Old Faithful area, learning about the park's history, wildlife, and geothermal wonders. \n\n**Day 2:** \n\n* **Morning Hike:** Embark on a guided hike to the Upper Geyser Basin, marveling at the iconic Old Faithful and other geothermal features. Enjoy a vegetarian picnic lunch overlooking the geysers.\n* **Afternoon Wildlife Viewing:** Join Paulo for a wildlife tour by bus, searching for bison, elk, wolves, and other animals in their natural habitat.\n* **Evening Program:** Participate in a park ranger-led program focused on sustainable practices in Yellowstone.\n\n**Day 3:**\n\n* **Earth Day Celebration:** Join a park-organized Earth Day celebration, participating in activities like planting trees, cleaning trails, and learning about conservation efforts.\n* **Afternoon Hike:** Hike to the Grand Prismatic Spring, the park's largest hot spring, and learn about its colorful bacteria and geothermal processes.\n* **Dinner and Stargazing:** Enjoy a delicious vegetarian dinner at the hotel and afterwards, join Paulo for an evening of stargazing, learning about the constellations and the importance of protecting our night skies.\n\n**Day 4:**\n\n* **Morning Hike:** Embark on a guided hike to the Mammoth Hot Springs, exploring the travertine terraces and learning about their formation. \n* **Afternoon Exploration:** Take a scenic drive through Lamar Valley, known for its abundant wildlife, including wolves and grizzly bears.\n* **Evening Relaxation:** Relax in the hotel's cozy lounge or enjoy a book by the fireplace.\n\n**Day 5:**\n\n* **Morning Ride:** Enjoy a guided horseback riding tour through the park's meadows and forests, connecting with nature in a unique way.\n* **Afternoon Fishing:**  Learn the art of fly fishing in a pristine Yellowstone lake with Paulo, focusing on catch-and-release techniques for responsible fishing.\n* **Evening BBQ:**  Enjoy a vegetarian BBQ under the stars with Paulo, sharing stories and experiences from the trip.\n\n**Day 6:**\n\n* **Morning Hike:**  Hike to the Roosevelt Arch, a historic landmark marking the park's entrance, learning about the park's conservation history.\n* **Afternoon Exploration:**  Take a leisurely walk through the Hayden Valley, searching for wildlife and taking in the expansive views.\n* **Evening Farewell Dinner:** Share a final delicious vegetarian dinner with Paulo and your fellow travelers, reminiscing about your adventures.\n\n**Day 7:**\n\n* **Departure:** Enjoy breakfast at the hotel before departing Yellowstone National Park.\n\n**Sustainable Practices:**\n\n* Utilizing park shuttles and buses for transportation within the park.\n* Staying in a family-friendly mountain hotel with a focus on sustainability.\n* Choosing vegetarian meals to minimize your carbon footprint.\n* Participating in park activities that promote conservation and education.\n* Using reusable water bottles and reducing single-use plastics.\n* Leaving no trace behind while hiking and exploring the park.\n\n**Note:** This itinerary is just a suggestion and can be customized to your interests and needs. Paulo can provide recommendations and guidance on activities, hikes, and transportation options within the park. \n\nThis eco-friendly adventure in Yellowstone promises to be an unforgettable experience, allowing you to connect with nature, learn about sustainable practices, and celebrate Earth Day in a truly inspiring setting."
    },
    {
      "id": 51,
      "name": "Viagem para o Canada",
      "description": "Viagem sustentavel no canada",
      "location": "Canad",
      "placeID": 2,
      "accomodationID": 3,
      "transportationID": 2,
      "mealID": 4,
      "eventID": 2,
      "guideID": 1,
      "packageID": 1,
      "promptText": "",
      "geminiAI": "## Eco-Friendly Adventure: Earth Day in the Mountains with Paulo\n\n**Destination:**  **Banff National Park, Canada**\n\n**Accommodation:** **The Fairmont Banff Springs** -  A historic mountain hotel with family-friendly amenities, known for its commitment to sustainability initiatives.\n\n**Transportation:**  **Bus** (You've got it!)\n\n**Guide:** **Paulo**\n\n**Package:** **Eco-Friendly Adventure**\n\n**Itinerary:**\n\n**Day 1:**\n\n* **Morning:** Arrive at Calgary International Airport (YYC) and take a scenic bus ride to Banff National Park. \n* **Afternoon:** Check into The Fairmont Banff Springs, explore the hotel's grounds and enjoy a vegetarian lunch at one of their restaurants.\n* **Evening:** Join Paulo for a guided hike to Johnston Canyon, marvel at the frozen waterfalls, and learn about the park's ecology. Enjoy a vegetarian dinner at a local restaurant.\n\n**Day 2: Earth Day Celebrations!**\n\n* **Morning:** Join Paulo for an exciting guided hike to Lake Louise, where you'll learn about the history of the area and its conservation efforts.\n* **Afternoon:** Participate in an Earth Day celebration at the Banff National Park Visitor Center. Enjoy live music, learn about sustainable practices, and engage in hands-on activities. \n* **Evening:** Enjoy a delicious vegetarian dinner at a restaurant with panoramic views of the mountains.\n\n**Day 3:**\n\n* **Morning:** Embark on a scenic bus ride to Moraine Lake, known for its stunning turquoise waters. Enjoy a leisurely walk along the lake shore and learn about the delicate alpine ecosystem.\n* **Afternoon:**  Engage in a sustainable activity like a guided wildlife tour or a nature photography workshop led by Paulo. \n* **Evening:**  Enjoy a farewell dinner at The Fairmont Banff Springs, reflecting on your eco-friendly adventure.\n\n**Day 4:**\n\n* **Morning:**  Depart from Banff National Park and take a bus back to Calgary International Airport (YYC).\n\n**Sustainable Practices:**\n\n* **Eco-Friendly Accommodation:**  The Fairmont Banff Springs is committed to sustainable practices, reducing waste, conserving energy, and using eco-friendly products.\n* **Responsible Transportation:** Bus travel is a more sustainable option compared to flying or driving individual vehicles.\n* **Local and Sustainable Food:**  Enjoy vegetarian meals prepared with locally sourced ingredients and support eco-conscious restaurants.\n* **Minimize Your Impact:**  Follow Leave No Trace principles, pack out all trash, stay on designated trails, and be mindful of the fragile environment.\n* **Educational Activities:** Participate in guided tours and activities that increase your understanding of the environment and its conservation.\n\nThis itinerary combines exciting adventures with sustainable practices, allowing you to celebrate Earth Day in a beautiful and meaningful way. You'll enjoy the magnificent landscapes of Banff National Park while supporting its conservation efforts and creating a positive impact on the environment. \n"
    }
  ]
}
